{"text": "CHAPTER I STATE, SOVEREIGNTY AND CITIZENS"}
{"text": "1. Constitution"}
{"text": "This is the &quot;Constitution of the Republic of the Maldives&quot;. Any reference to the &quot;Constitution&quot; herein is a reference to the Constitution of the Republic of the Maldives."}
{"text": "2. Republic of the Maldives"}
{"text": "The Maldives is a sovereign, independent, democratic Republic based on the principles of Islam, and is a unitary State, to be known as the Republic of the Maldives. Any reference to &quot;the Maldives&quot; is a reference to the Republic of the Maldives."}
{"text": "3. Territory of the Maldives"}
{"text": "The territory of the Maldives encompasses the land, airspace, sea and seabed within the archipelagic baselines of the Maldives drawn in accordance with the law, and includes the territorial waters, the seabed and air space thereof beyond the said baselines. Any changes to the territory of the Maldives may only be made pursuant to a law enacted by at least a two-third majority of the total membership of the People&#x27;s Majlis."}
{"text": "4. Powers of the citizens"}
{"text": "All the powers of the State of the Maldives are derived from, and remain with, the citizens."}
{"text": "5. Legislative power"}
{"text": "All legislative power in the Maldives is vested in the People&#x27;s Majlis."}
{"text": "6. Executive power"}
{"text": "As provided for in this Constitution the executive power is vested in the President."}
{"text": "7. Judicial power"}
{"text": "The judicial power is vested in the courts of the Maldives."}
{"text": "8. Supremacy of Constitution"}
{"text": "The powers of the State shall be exercised in accordance with this Constitution."}
{"text": "9. Citizens"}
{"text": "The following persons are citizens of the Maldives:"}
{"text": "citizens of the Maldives at the commencement of this Constitution;"}
{"text": "children born to a citizen of the Maldives; and"}
{"text": "foreigners who, in accordance with the law, become citizens of the Maldives."}
{"text": "No citizen of the Maldives may be deprived of citizenship."}
{"text": "Any person who wishes to relinquish his citizenship may do so in accordance with law."}
{"text": "Despite the provisions of article (a) a non-Muslim may not become a citizen of the Maldives."}
{"text": "10. State Religion"}
{"text": "The religion of the State of the Maldives is Islam. Islam shall be the one of the basis of all the laws of the Maldives"}
{"text": "No law contrary to any tenet of Islam shall be enacted in the Maldives"}
{"text": "11. National Language"}
{"text": "The national language of the Maldives is Dhivehi."}
{"text": "12. National Flag"}
{"text": "The national flag of the Maldives consists of a white crescent in the centre of a green rectangle surrounded by a red border."}
{"text": "The dimensions and colour code of the national flag and the placing of the crescent on the national flag shall be as specified in Schedule 3 of this Constitution."}
{"text": "13. Currency of the Maldives"}
{"text": "The unit of currency of the Maldives is the Rufiyaa, divided into one hundred Laari."}
{"text": "14. Capital"}
{"text": "The capital of the Maldives is the island of Male&#x27;."}
{"text": "15. National Day"}
{"text": "The national day of the Maldives is the first day of the month of Rabeeu al-Awwal."}
{"text": "CHAPTER II. FUNDAMENTAL RIGHTS AND FREEDOMS"}
{"text": "16. Guarantee of Rights"}
{"text": "This Constitution guarantees to all persons, in a manner that is not contrary to any tenet of Islam, the rights and freedoms contained within this Chapter, subject only to such reasonable limits prescribed by a law enacted by the People&#x27;s Majlis in a manner that is not contrary to this Constitution. Any such law enacted by the People&#x27;s Majlis can limit the rights and freedoms to any extent only if demonstrably justified in a free and democratic society."}
{"text": "The limitation of a right or freedom specified in this Chapter by a law enacted by the People&#x27;s Majlis as provided for in this Constitution, and in order to protect and maintain the tenets of Islam, shall not be contrary to article (a)."}
{"text": "In deciding whether a right or freedom in this Chapter, has been limited in accordance with article (a) and (b), a court must be fully cognisant of and make reference to all the facts, including:"}
{"text": "the nature and character of the right or freedom;"}
{"text": "the purpose and importance of limiting the right or freedom;"}
{"text": "the extent and manner of limiting the right or freedom;"}
{"text": "the relationship between the limitation of the right or freedom and the importance of the right or freedom;"}
{"text": "the extent to which the objective for which the right or freedom has been limited could have been achieved by limiting the right or freedom to a lesser degree;"}
{"text": "the extent to which the right or freedom must be limited in order to protect the tenets of Islam, where the right or freedom has been limited pursuant to article (b)."}
{"text": "The onus of establishing that the limitation to any extent, of a right or freedom included in this Chapter is within the reasonable limitations prescribed in this Constitution is on the State or the person asserting the limitation of the right or freedom."}
{"text": "17. Non-discrimination"}
{"text": "Everyone is entitled to the rights and freedoms included in this Chapter without discrimination of any kind, including race, national origin, colour, sex, age, mental or physical disability, political or other opinion, property, birth or other status, or native island."}
{"text": "Special assistance or protection to disadvantaged individuals or groups, or to groups requiring special social assistance, as provided in law shall not be deemed to be discrimination, as provided for in article (a)."}
{"text": "18. Duty of the State"}
{"text": "It is the duty of the State to follow the provisions of this Constitution, and to protect and promote the rights and freedoms provided in this Chapter."}
{"text": "19. Freedom from restraint"}
{"text": "A citizen is free to engage in any conduct or activity that is not expressly prohibited by Islamic Shari&#x27;ah or by law. No control or restraint may be exercised against any person unless it is expressly authorised bylaw."}
{"text": "20. Equality"}
{"text": "Every individual is equal before and under the law, and has the right to the equal protection and equal benefit of the law."}
{"text": "21. Right to life"}
{"text": "Everyone has the right to life, liberty and security of the person, and the right not be deprived thereof to any extent except pursuant to a law made in accordance with Article 16 of this Constitution."}
{"text": "22. Protection of the environment"}
{"text": "The State has a fundamental duty to protect and preserve the natural environment, biodiversity, resources and beauty of the country for the benefit of present and future generations. The State shall undertake and promote desirable economic and social goals through ecologically balanced sustainable development and shall take measures necessary to foster conservation, prevent pollution, the extinction of any species and ecological degradation from any such goals."}
{"text": "23. Economic and social rights"}
{"text": "Every citizen the following rights pursuant to this Constitution, and the State undertakes to achieve the progressive realisation of these rights by reasonable measures within its ability and resources:"}
{"text": "adequate and nutritious food and clean water;"}
{"text": "clothing and housing;"}
{"text": "good standards of health care, physical and mental;"}
{"text": "a healthy and ecologically balanced environment;"}
{"text": "equal access to means of communication, the State media, transportation facilities, and the natural resources of the country;"}
{"text": "the establishment of a sewage system of a reasonably adequate standard on every inhabited island;"}
{"text": "the establishment of an electricity system of a reasonably adequate standard on every inhabited island that is commensurate to that island."}
{"text": "24. Privacy"}
{"text": "Everyone has the right to respect for his private and family life, his home and his private communications. Every person must respect these rights with respect to others."}
{"text": "25. No slavery or forced labour"}
{"text": "No one shall be held in slavery or servitude, or be required to perform forced labour."}
{"text": "Compulsory military service, service required in cases of emergency or calamity threatening the life or well-being of the community, or service required pursuant to a court order shall not be deemed to be contrary to article (a)."}
{"text": "26. Right to vote and run for public office"}
{"text": "Unless otherwise provided in this Constitution, every citizen of the Maldives eighteen years of age or older has the right:"}
{"text": "to vote in elections, and in public referendums, which shall be held by secret ballot;"}
{"text": "to run for public office;"}
{"text": "to take part in the conduct of public affairs, directly or through freely chosen representatives."}
{"text": "27. Freedom of expression"}
{"text": "Everyone has the right to freedom of thought and the freedom to communicate opinions and expression in a manner that is not contrary to any tenet of Islam."}
{"text": "28. Freedom of the media"}
{"text": "Everyone has the right to freedom of the press, and other means of communication, including the right to espouse, disseminate and publish news, information, views and ideas. No person shall be compelled to disclose the source of any information that is espoused, disseminated or published by that person."}
{"text": "29. Freedom of acquiring and imparting knowledge"}
{"text": "Everyone has the freedom to acquire and impart knowledge, information and learning."}
{"text": "30. Freedom to form political parties, associations and societies"}
{"text": "Every citizen has the right to establish and to participate in the activities of political parties."}
{"text": "Everyone has the freedom to form associations and societies, including the following:"}
{"text": "the right to establish and participate in any association or society for economic, social, educational or cultural or purposes;"}
{"text": "the right to form trade unions, to participate or not participate in their activities."}
{"text": "31. Right to strike"}
{"text": "Every person employed in the Maldives and all other workers have the freedom to stop work and to strike in order to protest."}
{"text": "32. Freedom of assembly"}
{"text": "Everyone has the right to freedom of peaceful assembly without prior permission of the State."}
{"text": "33. Right to protect reputation and name"}
{"text": "Everyone has the right to protect one&#x27;s reputation and good name."}
{"text": "34. Right to marry and establishment of the family"}
{"text": "Every person of marriageable age as determined by law has the right to marry, and to establish a family as specified in law. The family, being the natural and fundamental unit of society, is entitled to special protection by society and the State."}
{"text": "Children must be afforded special protection as specified in law in the event of a marital breakdown of the parents."}
{"text": "35. Special protection to children, young, elderly and disadvantaged people"}
{"text": "Children and young people are entitled to special protection and special assistance from the family, the community and the State. Children and young people shall not be harmed, sexually abused, or discriminated against in any manner and shall be free from unsuited social and economic exploitation. No person shall obtain undue benefit from their labour."}
{"text": "Elderly and disadvantaged persons are entitled to protection and special assistance from the family, the community and the State."}
{"text": "36. Right to education"}
{"text": "Everyone has the right to education without discrimination of any kind."}
{"text": "Primary and secondary education shall be freely provided by the State. It is imperative on parents and the State to provide children with primary and secondary education. Opportunity for higher education shall be generally accessible to all citizens."}
{"text": "Education shall strive to inculcate obedience to Islam, instil love for Islam, foster respect for human rights, and promote understanding, tolerance and friendship among all people."}
{"text": "37. Right to work"}
{"text": "Every citizen has the right to engage in any employment or occupation."}
{"text": "Everyone is entitled to just and safe conditions of work, fair wages, equal remuneration for work of equal value, and equal opportunity for promotion."}
{"text": "Everyone has the right to rest and leisure, including limits on hours of work and periodic holidays with pay."}
{"text": "Everyone has the right to spend time at rest and leisure. In order to provide this right to each employed person, the maximum number of working hours have to be determined as well as the length of paid holidays."}
{"text": "38. Right of pension"}
{"text": "Every one engaged in employment with the State shall have the right of pension as provided by law."}
{"text": "39. Right to participate in cultural life"}
{"text": "Everyone has the right to participate in the cultural life of the nation, and to benefit from literary and artistic endeavours."}
{"text": "The State shall promote education, culture, literature and the arts, within the limits of its resources."}
{"text": "40. Right to acquire and hold property"}
{"text": "Every citizen has the right to acquire, own, inherit, transfer or otherwise transact of such property."}
{"text": "Private property shall be inviolable, and may only be compulsorily acquired by the State for the public good, as expressly prescribed by law, and as authorised by order of the court. Fair and adequate compensation shall be paid in all cases, as determined by the court."}
{"text": "Nothing in this Article prevents any law authorising a court to order the forfeiture(without the giving of any compensation) of illegally acquired or possessed property, or enemy property."}
{"text": "Property of a person shall not be forfeited in substitution for any offence."}
{"text": "41. Freedom of movement and establishment"}
{"text": "Every citizen has the freedom to enter, remain in and leave the Maldives, and to travel within the Maldives."}
{"text": "Every citizen has the right to move to, and take up residence on, any inhabited island of the Maldives."}
{"text": "Every citizen shall have equal access to the receipt of rights and benefits from any island where he has established residency."}
{"text": "42. Fair and transparent hearings"}
{"text": "In the determination of one&#x27;s civil rights and obligations or of any criminal charge, everyone is entitled to a fair and public hearing within a reasonable time by an independent court or tribunal established by law."}
{"text": "All judicial proceedings in the Maldives shall be conducted with justice, transparency and impartiality."}
{"text": "Trials of any matter shall be held publicly, but the presiding judge may exclude the public from all or part of a trial in accordance with democratic norms:"}
{"text": "in the interests of public morals, public order or national security;"}
{"text": "where the interest of juveniles or the victims of a crime so require; or"}
{"text": "in other special circumstances where publicity would prejudice the interests of justice."}
{"text": "All judgements or orders of a Court shall be pronounced publicly, unless the Court specifically orders otherwise for the reasons stipulated in article (c). All publicly pronounced judgements or orders shall be available to the public."}
{"text": "43. Fair administrative action"}
{"text": "Everyone has the right to administrative action that is lawful, procedurally fair, and expeditious."}
{"text": "Everyone whose rights have been adversely affected by administrative action has the right to be given written reasons."}
{"text": "Where the rights of a person, a group or community has been adversely affected by administrative action, every such person, group or every person who may be directly affected by such action has the right to submit the matter to court."}
{"text": "44. Personal liability"}
{"text": "The application of the criminal law or criminal procedure, including the conduct of investigations, criminal proceedings and enforcement of sentences as provided by law, shall extend to the accused person only and shall not affect the legal rights or obligations of any other person."}
{"text": "45. No unlawful arrest or detention"}
{"text": "Everyone has the right not to be arbitrarily detained, arrested or imprisoned except as provided by law enacted by the People&#x27;s Majlis in accordance with Article 16 of this Constitution."}
{"text": "46. Power of arrest and detention"}
{"text": "No person shall be arrested or detained for an offence unless the arresting officer observes the offence being committed, or has reasonable and probable grounds or evidence to believe the person has committed an offence or is about to commit an offence, or under the authority of an arrest warrant issued by the court."}
{"text": "47. Search and seizure"}
{"text": "No person shall be subject to search or seizure unless there is reasonable cause."}
{"text": "Residential property shall be inviolable, and shall not be entered without the consent of the resident, except to prevent immediate and serious harm to life or property, or under the express authorisation of an order of the Court."}
{"text": "48. Rights on arrest or detention"}
{"text": "Everyone has the right on arrest or detention:"}
{"text": "to be informed immediately of the reasons therefore, and in writing within at least twenty four hours;"}
{"text": "to retain and instruct legal counsel without delay and to be informed of this right, and to have access to legal counsel facilitated until the conclusion of the matter for which he is under arrest or detention;"}
{"text": "to remain silent, except to establish identity, and to be informed of this right;"}
{"text": "to be brought within twenty four hours before a Judge, who has power to determine the validity of the detention, to release the person with or without conditions, or to order the continued detention of the accused."}
{"text": "49. Release of accused"}
{"text": "No person shall be detained in custody prior to sentencing, unless the danger of the accused absconding or not appearing at trial, the protection of the public, or potential interference with witnesses or evidence dictate otherwise. The release may be subject to conditions of bail or other assurances to appear as required by the court."}
{"text": "50. Prompt investigation and prosecution"}
{"text": "After notice of an alleged offence has been brought to the attention of the investigating authorities, the matter shall be investigated promptly, and where warranted, the Prosecutor General shall lay charges as quickly as possible."}
{"text": "51. Rights of the accused"}
{"text": "Everyone charged with an offence has the right:"}
{"text": "to be informed without delay of the specific offence in a language understood by the accused;"}
{"text": "to be tried within a reasonable time;"}
{"text": "not to be compelled to testify;"}
{"text": "to an interpreter to be provided by the State where he does not speak the language in which the proceedings are conducted, or is deaf or mute;"}
{"text": "to have adequate time and facilities for the preparation of his defence and to communicate with and instruct legal counsel of his own choosing;"}
{"text": "to be tried in person, and to defend himself through legal counsel of his own choosing;"}
{"text": "to examine the witnesses against him and to obtain the attendance and examination of witnesses;"}
{"text": "to be presumed innocent until proven guilty beyond a reasonable doubt."}
{"text": "52. Confessions and illegal evidence"}
{"text": "No confession shall be admissible in evidence unless made in court by an accused who is in a sound state of mind. No statement or evidence must be obtained from any source by compulsion or by unlawful means and such statement or evidence is inadmissible in evidence."}
{"text": "53. Assistance of legal counsel"}
{"text": "Everyone has the right to retain legal counsel at any instance assistance is required."}
{"text": "In serious criminal cases, the State a lawyer for an accused person  and instruct where legal shall provide who cannot afford to engage one."}
{"text": "54. No degrading treatment or torture"}
{"text": "No person shall be subjected to cruel, inhumane or degrading treatment or punishment, or to torture."}
{"text": "55. No imprisonment for non-fulfilment of contractual obligation"}
{"text": "No person shall be imprisoned on the ground of non-fulfillment of a contractual obligation."}
{"text": "56. Right to appeal"}
{"text": "Everyone related to a matter has the right to appeal a conviction and sentence, or judgement or order in a criminal or civil matter."}
{"text": "57. Humane treatment of arrested or detained persons"}
{"text": "Everyone deprived of liberty through arrest or detention as provided by law, pursuant to an order of the court, or being held in State care for social reasons, shall be treated with humanity and with respect for the inherent dignity of the human person. A person may be deprived of the rights or freedoms specified in this Chapter only to the extent required for the purpose for which he is deprived of his liberty."}
{"text": "58. Compensation"}
{"text": "Everyone who has been arrested or detained without legal authority or justification has the right to be compensated."}
{"text": "59. Retrospective legislation"}
{"text": "No person shall be found guilty of any act or omission which did not constitute an offence under Islamic Shari&#x27;ah or law at the time committed. Nor shall a more severe penalty be imposed than the one applicable at the time the offence was committed. If the punishment for an offence has been reduced between the time of commission and the time of sentencing, the accused is entitled to the benefit of the lesser punishment."}
{"text": "This Article shall not prejudice the trial and punishment of any person for any act which was criminal according to international law."}
{"text": "60. Prohibition of double jeopardy"}
{"text": "If an accused is acquitted of an offence by a court, he shall not be tried again for the same or substantially the same offence. If an accused is found guilty and punished for an offence he shall not be tried or punished again for the same or substantially the same offence."}
{"text": "The principle stated in article (a) does not apply to appeals relating to the offence."}
{"text": "61. Publication of acts and regulations"}
{"text": "All statutes, regulations, government orders requiring compliance by citizens and government policies shall be published and made available to the public."}
{"text": "No person may be subjected to any punishment except pursuant to a statute or pursuant to a regulation made under authority of a statute, which has been made available to the public and which defines the criminal offence and the punishment for commission of the offence."}
{"text": "All information concerning government decisions and actions shall be made public, except information that is declared to be State secrets by a law enacted by the People&#x27;s Majlis."}
{"text": "Every citizen has the right to obtain all information possessed by the Government about that person."}
{"text": "62. Retention of other rights"}
{"text": "The enumeration of rights and freedoms in this Chapter are guaranteed equally to female and male persons."}
{"text": "The enumeration of rights and freedoms individually in this Chapter shall not be construed to deny or negate other rights retained by the people which are not specified in this Chapter."}
{"text": "63. Voidance of laws inconsistent with fundamental rights"}
{"text": "Any law or part of any law contrary to the fundamental rights or freedoms guaranteed by this Chapter shall be void or void to the extent of such inconsistency."}
{"text": "64. Non-compliance with unlawful orders"}
{"text": "No employee of the State shall impose any orders on a person except under authority of a law. Everyone has the right not to obey an unlawful order."}
{"text": "65. Application to court to obtain a remedy"}
{"text": "Anyone whose rights or freedoms, as guaranteed by this Chapter, have been infringed or denied may apply to a court to obtain a just remedy."}
{"text": "66. Voidance of laws inconsistent with rights and freedoms"}
{"text": "All existing statutes, regulations, decrees and notices inconsistent with the fundamental rights and freedoms provisions in this Chapter shall, to the extent of the inconsistency, become void on the commencement of this Constitution."}
{"text": "67. Responsibilities and duties"}
{"text": "The exercise and enjoyment of fundamental rights and freedoms is inseparable from the performance of responsibilities and duties, and it is the responsibility of every citizen:"}
{"text": "to respect and protect the rights and freedoms of others;"}
{"text": "to foster tolerance, mutual respect, and friendship among all people and groups;"}
{"text": "to contribute to the well-being and advancement of the community;"}
{"text": "to promote the sovereignty, unity, security, integrity and dignity of the Maldives;"}
{"text": "to respect the Constitution and the rule of law;"}
{"text": "to promote democratic values and practices in a manner that is not inconsistent with any tenet of Islam;"}
{"text": "to preserve and protect the State religion of Islam, culture, language and heritage of the country;"}
{"text": "to preserve and protect the natural environment, biodiversity, resources and beauty of the country and to abstain from all forms of pollution and ecological degradation;"}
{"text": "to respect the national flag, state emblem and the national anthem."}
{"text": "Every person in the Maldives must also respect these duties."}
{"text": "68. Interpretation"}
{"text": "When interpreting and applying the rights and freedoms contained within this Chapter, a court or tribunal shall promote the values that underlie an open and democratic society based on human dignity, equality and freedom, and shall consider international treaties to which the Maldives is a party."}
{"text": "69. Non-destructive interpretation of Constitution"}
{"text": "No provision of the Constitution shall be interpreted or translated in a manner that would grant to the State or any group or person the right to engage in any activity or perform any act aimed at the destruction of the rights and freedoms set out in this Constitution."}
{"text": "CHAPTER III. THE PEOPLE&#x27;S MAJLIS"}
{"text": "70. Legislative authority"}
{"text": "The legislative authority of the Maldives shall be vested in the People&#x27;s Majlis."}
{"text": "The law making powers of the People&#x27;s Majlis pursuant to article (a), includes the following powers:"}
{"text": "the amendment of this Constitution, in accordance with the terms provided herein;"}
{"text": "the enactment of legislation with regard to any matter, or the amendment or repeal of any law, which is not inconsistent with any tenet of Islam;"}
{"text": "the supervision of the exercise of executive authority and ensuring the executive authority is accountable for the exercise of its powers, and taking the steps required for ensuring the same;"}
{"text": "the approval of the annual budget and any supplementary budget;"}
{"text": "the determination of matters relating to Independent Commissions and Independent Offices in accordance with law;"}
{"text": "the holding of public referendums on issues of public importance;"}
{"text": "the performance of all duties otherwise expressly required by this Constitution and by law."}
{"text": "The People&#x27;s Majlis shall not pass any law that contravenes any tenet of Islam."}
{"text": "Any matter submitted to the People&#x27;s Majlis for approval includes the power of the People&#x27;s Majlis to accept, reject, revoke or amend the disposition of the matter."}
{"text": "Any appointment or dismissal submitted to the People&#x27;s Majlis for approval includes the power of the People&#x27;s Majlis to accept or reject the appointment or dismissal."}
{"text": "71. Determination of the composition of the People’s Majlis"}
{"text": "The membership of the People&#x27;s Majlis shall be determined in accordance with the following principles:"}
{"text": "two members for the first five thousand residents registered for each administrative division or two members for administrative divisions with less than five thousand residents; and"}
{"text": "where the residents registered to an administrative division exceed five thousand residents, one additional member for each group of five thousand residents in excess of the first five thousand."}
{"text": "The administrative divisions at the time this Constitution comes into force, referred to in this Article shall be the twenty administrative Atolls plus Male&#x27;, for a total of twenty one. The details of the administrative divisions are specified in Schedule 2 of this Constitution."}
{"text": "72. Election of members"}
{"text": "Each administrative division shall establish separate electoral constituencies in accordance with the principles specified in Article 71 of this Constitution. All members shall be elected from a separate electoral constituency."}
{"text": "The person elected from amongst those standing for election in each separate electoral constituency shall be the person receiving the greatest number of votes by secret ballot."}
{"text": "A law shall specify the manner of determining the number of electoral constituencies in each administrative division and the boundaries of each electoral constituency. Such law shall specify the principles pursuant to which the population on each administrative division shall be divided into the separate electoral constituencies such that there is an approximately equal division of the population."}
{"text": "73. Qualifications of members"}
{"text": "A person elected to be a member of the People&#x27;s Majlis shall be so qualified if he:"}
{"text": "is a citizen of the Maldives;"}
{"text": "is not a citizen of a foreign country;"}
{"text": "is a Muslim and a follower of a Sunni school of Islam;"}
{"text": "has attained the age of eighteen years; and"}
{"text": "is of sound mind."}
{"text": "A person who has acquired Maldivian citizenship is qualified to be a member of the People&#x27;s Majlis five years after the acquisition of citizenship and is domiciled in the Maldives."}
{"text": "A person shall be disqualified from election as, a member of the People&#x27;s Majlis, or a member of the People&#x27;s Majlis immediately becomes disqualified, if he:"}
{"text": "has a decreed debt which is not being paid as provided in the judgement;"}
{"text": "has been convicted of a criminal offence and is serving a sentence of more than twelve months;"}
{"text": "has been convicted of a criminal offence and sentenced to a term of more than twelve months, unless a period of three years has elapsed since his release, or pardon for the offence for which he was sentenced;"}
{"text": "is a member of the Judiciary."}
{"text": "Unless otherwise specifically provided in the Constitution, a member of the People&#x27;s Majlis shall not continue to hold office in:"}
{"text": "the Cabinet of Ministers;"}
{"text": "the office of State Minister, Deputy Minister, or other State office of an equivalent level;"}
{"text": "an Independent Commission or an Independent Office;"}
{"text": "the Civil Service;"}
{"text": "a corporation wholly or partly owned or managed by the Government;"}
{"text": "the Armed Forces;"}
{"text": "the Police;"}
{"text": "any other office of the State except an office held by virtue of being a member of the People&#x27;s Majlis."}
{"text": "74. Court jurisdiction"}
{"text": "Any question concerning the qualifications or removal, or vacating of seats, of a member of the People&#x27;s Majlis shall be determined by the Supreme Court."}
{"text": "75. Function of members"}
{"text": "Members of the People&#x27;s Majlis should be guided in their actions by considerations of national interest and public welfare foremost, and should not exploit their official positions in any way for their own benefit or for the benefit of those with whom they have special relations. They shall represent not only their constituencies but the country as a whole."}
{"text": "76. Declaration of assets"}
{"text": "Every member shall annually submit to the Secretary General of the People&#x27;s Majlis a statement of all property and monies owned by him, business interests and liabilities. Such declarations shall include the details of any other employment and obligations of such employment."}
{"text": "77. Resignation"}
{"text": "A member of the People&#x27;s Majlis may resign his seat by writing under his hand addressed to the Speaker, and the seat shall become vacant when the resignation is received by the Speaker."}
{"text": "78. Filling vacancy"}
{"text": "Whenever there is a vacancy among the members of the People&#x27;s Majlis, an election shall be held within sixty days from the date of the vacancy. A by-election shall not be held within six months prior to a general election."}
{"text": "79. Term of the People’s Majlis"}
{"text": "The People&#x27;s Majlis shall continue for five years from the date of its first sitting, and shall then stand dissolved. The first sitting of the newly elected People&#x27;s Majlis shall be held immediately after the dissolution of the previous People&#x27;s Majlis."}
{"text": "Election of members to the new People&#x27;s Majlis and all matters pertaining thereto shall be concluded thirty days prior to the expiration of the existing People&#x27;s Majlis."}
{"text": "80. Extension of term of the People’s Majlis"}
{"text": "In the event of a declaration of a state of emergency, making it difficult to hold a general election, the term of the People&#x27;s Majlis may be extended by a resolution enacted by the People&#x27;s Majlis for a period not exceeding one year if such resolution is supported by two-thirds of the total membership of the People&#x27;s Majlis. When the declaration of the state of emergency expires or is revoked during an extended term, the People&#x27;s Majlis shall not continue for a period longer than sixty days, and all matters relating to the election of a new People&#x27;s Majlis shall be completed within that time."}
{"text": "81. Oath of office of members of the People’s Majlis"}
{"text": "A person elected as a member of the People&#x27;s Majlis shall assume membership in the People&#x27;s Majlis upon taking and subscribing, before the Chief Justice or his designate, the oath of office of members of the People&#x27;s Majlis set out in Schedule 1of this Constitution."}
{"text": "82. Speaker and Deputy Speaker of the People’s Majlis"}
{"text": "The People&#x27;s Majlis shall at the first sitting after the general election elect a Speaker and a Deputy Speaker from its members by secret ballot. Until such time as a Speaker and a Deputy Speaker is elected the People&#x27;s Majlis shall be presided over by the consecutively longest serving member from among those present. Where there are a number of members who have consecutively served the longest then the Majlis shall be presided over by the member most senior by age of those having served consecutively the longest."}
{"text": "The Speaker, or in his absence the Deputy Speaker, shall preside over sittings of the People&#x27;s Majlis, and if neither is present, a person to preside over the sitting shall be determined as provided in the Regulations governing the Proceedings of People&#x27;s Majlis."}
{"text": "The Speaker may resign from his post by writing under his hand addressed to the Deputy Speaker, and the post shall become vacant when the resignation is received by the Deputy Speaker. The Deputy Speaker may resign from his post by writing under his hand addressed to the Speaker, and the post shall become vacant when the resignation is received by the Speaker."}
{"text": "The Speaker or the Deputy Speaker shall vacate his office:"}
{"text": "if he ceases to be a member of the People&#x27;s Majlis; or"}
{"text": "if the People&#x27;s Majlis at any time so resolves."}
{"text": "No such resolution shall be moved unless fourteen days notice has been given to the People&#x27;s Majlis of the intention to move the resolution."}
{"text": "The Speaker shall not preside over the debate concerning his removal. The Deputy Speaker shall also not preside over any debate concerning his removal."}
{"text": "The Speaker and the Deputy Speaker have the right to take part and defend themselves in any debate concerning their removal. However they may not take part in any vote concerning their removal."}
{"text": "83. Sittings of the People’s Majlis"}
{"text": "There shall be at least three sessions of the People&#x27;s Majlis every year. The dates for the commencement and conclusion of the sessions must be specified in the Regulations governing the Proceedings of People&#x27;s Majlis. The sessions shall generally be held at the House of the People&#x27;s Majlis."}
{"text": "84. Presidential address"}
{"text": "At the beginning of the first session of each year at the first sitting, the President shall address the People&#x27;s Majlis on the state of the country, and may present proposals for improving the state of the country to the People&#x27;s Majlis."}
{"text": "85. Proceedings open to the public"}
{"text": "Subject to article (b), meetings of the People&#x27;s Majlis and its committees shall be open to the public."}
{"text": "A majority of those present and voting of the members of the People&#x27;s Majlis or of a committee may decide to exclude the public and the press from all or any part of the proceedings if there is a compelling need to do so in the interests of public order or national security."}
{"text": "Article (b) does not prevent the People&#x27;s Majlis from specifying additional reasons for excluding the public from all or any part of a committee meeting of the People&#x27;s Majlis."}
{"text": "86. Quorum"}
{"text": "The presence of at least twenty five percent of the members, shall constitute a quorum of the People&#x27;s Majlis."}
{"text": "87. Voting"}
{"text": "Unless otherwise provided in this Constitution, all decisions of the People&#x27;s Majlis shall be decided by a majority of votes of the members present and voting."}
{"text": "Despite the provisions of Article 86 of this Constitution, voting on any matter requiring compliance by citizens shall only be undertaken when more than half of the total membership of the People&#x27;s Majlis are present at the sitting at which the matter is voted upon."}
{"text": "The Speaker or other person presiding over sittings of the People&#x27;s Majlis shall not vote on any question, but in the event of an equality of votes, he shall have and exercise a casting vote."}
{"text": "The Speaker or other person presiding over sittings of the People&#x27;s Majlis may vote when a question must be decided by a two-thirds or three-quarters majority of the members."}
{"text": "88. Regulation of procedure"}
{"text": "Subject to the provisions of this Constitution, the People&#x27;s Majlis shall:"}
{"text": "determine and control its administrative arrangements, hiring and firing of employees, determination of salaries of employees, and manage all matters concerning the sittings of the People&#x27;s Majlis. The People&#x27;s Majlis shall make regulations concerning these matters;"}
{"text": "make regulations and principles concerning its business, with due regard to representative and participatory democracy, accountability, transparency and public involvement. Such regulations may include rules of decorum and attendance requirements, and, subject to the consent of two-thirds of the members, may provide for non-payment of salary and allowances."}
{"text": "Unless otherwise specified in this Constitution, the validity of any proceedings in the People&#x27;s Majlis shall not be questioned in any court of law."}
{"text": "89. Publication of proceedings of the People’s Majlis"}
{"text": "All proceedings of the People&#x27;s Majlis shall be published in the minutes of the People&#x27;s Majlis and available to the public."}
{"text": "90. Privilege"}
{"text": "No member or other person shall be liable to any proceedings in any court, and no person shall be subject to any inquiry, arrest, detention or prosecution, with respect to anything said in, produced before, or submitted to the People&#x27;s Majlis or any of its committees, or with respect to any vote given if the same is not contrary to any tenet of Islam."}
{"text": "No person or newspaper or journal shall be liable in respect of any report or proceedings made or published under the authority of the People&#x27;s Majlis, or in respect of any fair and accurate report of the proceedings of the People&#x27;s Majlis or any of its committees, where this is done in accordance with principles specified by the People&#x27;s Majlis."}
{"text": "91. Presidential assent or return for reconsideration"}
{"text": "Every Bill passed by the People&#x27;s Majlis shall be presented for assent by the President within seven days from the date of its passing, and the President shall, within fifteen days of receipt, assent to the Bill or return the Bill for reconsideration of the Bill or of any amendment proposed by the President."}
{"text": "Any Bill returned to the People&#x27;s Majlis for reconsideration shall be assented to by the President and published in the Government Gazette if the Bill, after reconsideration, is passed without any amendments, by a majority of the total membership of the People&#x27;s Majlis."}
{"text": "Any Bill not returned for reconsideration or amendment or assented to by the President within the specified time shall be deemed to have been assented to by the President and shall be published in the Government Gazette."}
{"text": "92. Publication of laws in the Government Gazette"}
{"text": "A Bill passed by the People&#x27;s Majlis shall become law when assented to by the President. Every Bill assented to by the President shall be published in the Government Gazette on the day of assent. Such law shall come into force when it is published in the Government Gazette, or on such later date following publication stipulated in the statute."}
{"text": "93. Treaties"}
{"text": "Treaties entered into by the Executive in the name of the State with foreign states and international organizations shall be approved by the People&#x27;s Majlis, and shall come into force only in accordance with the decision of the People&#x27;s Majlis."}
{"text": "Despite the provisions of article (a), citizens shall only be required to act in compliance with treaties ratified by the State as provided for in a law enacted by the People&#x27;s Majlis."}
{"text": "94. Delegation of power to make regulations and orders with lawful authority"}
{"text": "The People&#x27;s Majlis may, pursuant to law and for prescribed purposes, delegate to any person or body power to make orders, and regulations, or other instruments having legislative effect, including the power to:"}
{"text": "determine a date on which any law shall come into or cease to have effect;"}
{"text": "make any law or part thereof applicable to any area or to any class of persons."}
{"text": "95. Reference to Supreme Court"}
{"text": "The People&#x27;s Majlis may by resolution refer to the Supreme Court for hearing and consideration important questions of law concerning any matter, including the interpretation of the Constitution and the constitutional validity of any statute. The Supreme Court shall answer the questions so referred and shall provide the answers to the People&#x27;s Majlis, giving reasons for its answers. The opinion shall be pronounced in like manner as in the case of a judgment on appeal to the Supreme Court."}
{"text": "96. Annual budget"}
{"text": "Prior to the commencement of each financial year, the Minister of Finance shall submit for approval to the People&#x27;s Majlis a budget containing the projected revenue and expenditures for the year, and a statement of actual revenue and expenditures for the preceding year."}
{"text": "The People&#x27;s Majlis may approve or amend the budget submitted by the Minister of Finance as in its discretion it deems fit."}
{"text": "No supplementary expenditures shall be added to an approved budget without further approval by the People&#x27;s Majlis. Expenditures included in the budget shall be applied solely for the specified purpose."}
{"text": "97. Taxation and expenditures"}
{"text": "The Executive shall not:"}
{"text": "spend any public money or property;"}
{"text": "levy any taxation;"}
{"text": "obtain or receive any money or property by loan or otherwise;"}
{"text": "provide any sovereign guarantees;"}
{"text": "except pursuant to a law enacted by the People&#x27;s Majlis."}
{"text": "98. Questioning of Ministers and members of the Government"}
{"text": "The People&#x27;s Majlis may require the presence of any member of the Cabinet or member of the Government to attend proceedings of the People&#x27;s Majlis, and to respond under oath truthfully to questions put to them and to produce documents, required by the People&#x27;s Majlis relating to the due performance of the obligations and responsibilities of such person."}
{"text": "Every member of the People&#x27;s Majlis has the right to question, in the manner specified by the People&#x27;s Majlis and either orally or in writing, a member of the Cabinet or head of a Government office, concerning the performance of his duties."}
{"text": "Any member of the Cabinet or member of the Government office to whom a question is addressed as provided for in article (b) shall answer to the best of his knowledge and ability."}
{"text": "The questions and answers given as provided for in this Article, whether orally or in writing, shall be published in the same manner as the proceedings of the People&#x27;s Majlis."}
{"text": "99. Summoning persons"}
{"text": "The People&#x27;s Majlis or any of its committees has the power to:"}
{"text": "summon any person to appear before it to give evidence under oath, or to produce documents. Any person who is questioned by the People&#x27;s Majlis as provided for in this Article shall answer to the best of his knowledge and ability;"}
{"text": "require any person or institution to report to it;"}
{"text": "receive petitions, representations, or submissions from interested persons or institutions."}
{"text": "100. Removal of President or Vice President"}
{"text": "The People&#x27;s Majlis, by a resolution, may remove the President or the Vice President from office only on the grounds of:"}
{"text": "direct violation of a tenet of Islam, the Constitution or law;"}
{"text": "serious misconduct unsuited to the office of the President or Vice President; or"}
{"text": "inability to perform the responsibilities of office of President or Vice President."}
{"text": "A resolution as provided for in article (a), must be submitted to the People&#x27;s Majlis, under the hand of at least one third of the members, specifying the reasons."}
{"text": "The People&#x27;s Majlis may establish a committee to investigate the matters specified in the resolution calling for removal of the President or Vice President."}
{"text": "At least fourteen days notice of the debate in the People&#x27;s Majlis concerning such a resolution shall be given to the President or Vice President, and the President or the Vice President shall have the right to defend himself in the sittings of the People&#x27;s Majlis, both orally and in writing, and has the right to legal counsel."}
{"text": "A resolution to remove the President or Vice President from office as specified in article (a) shall only be passed if it receives a two-thirds majority of the total membership of the People&#x27;s Majlis, and in such event the President or Vice President shall cease to hold office."}
{"text": "The Regulations governing the functioning of the People&#x27;s Majlis shall specify the principles and procedures concerning a resolution to remove the President or Vice President from office as provided in this Constitution."}
{"text": "101. Vote of no confidence in a member of the Cabinet"}
{"text": "A motion expressing want of confidence in a member of the Cabinet may be moved in the People&#x27;s Majlis, under the hand of at least ten members, specifying the reasons."}
{"text": "At least fourteen days notice of the debate in the People&#x27;s Majlis concerning a motion under article (a) shall be given to the concerned member of the Cabinet, and he shall have the right to defend himself in the sittings of the People&#x27;s Majlis, both orally and in writing."}
{"text": "A motion of want of confidence concerning a member of the Cabinet shall be passed by a majority of the total membership of the People&#x27;s Majlis."}
{"text": "A member of Cabinet against whom a motion of want of confidence has been passed by the People&#x27;s Majlis shall cease to hold office."}
{"text": "102. Salary and allowances"}
{"text": "The President, Vice President, members of the Cabinet, members of the People&#x27;s Majlis, including the Speaker and Deputy Speaker, members of the Judiciary, and members of the Independent Commissions and Independent Offices shall be paid such salary and allowances as determined by the People&#x27;s Majlis."}
{"text": "103. Improper benefit"}
{"text": "The members of the People&#x27;s Majlis and persons appointed or employed by them shall not use their position or any information entrusted to them to improperly benefit themselves or any other person."}
{"text": "104. Secretary General"}
{"text": "The People&#x27;s Majlis shall, as provided for in its regulations, appoint a Secretary General to establish and manage the secretariat, to arrange for the sittings and documentation of the People&#x27;s Majlis, and generally to assist the Speaker and the members."}
{"text": "105. Security"}
{"text": "The security of the House of the People&#x27;s Majlis, all property attached thereto and all offices and facilities where its work is conducted shall be protected by the security services of the State."}
{"text": "The security services of the State shall ensure the protection and safety of all members of the People&#x27;s Majlis."}
{"text": "CHAPTER IV. THE PRESIDENT"}
{"text": "106. Executive power"}
{"text": "The executive power is vested in the President as provided for in the Constitution and the law."}
{"text": "The President shall be the Head of State, the Head of Government, and the Commander in Chief of the Armed Forces."}
{"text": "The principles of governance of the State being determined by this Constitution, the President shall uphold, defend and respect the Constitution, and shall promote the unity of the State."}
{"text": "The President shall exercise Executive authority as provided for in the Constitution and law."}
{"text": "107. Term of office"}
{"text": "The President shall hold office for a term of five years and no person elected as President pursuant to this Constitution shall serve for more than two terms in office, whether consecutive or otherwise."}
{"text": "A vacancy in the office of President leading to the Vice President succeeding to the presidency shall only be considered as a term in office within the meaning of article (a) if there are at least two years remaining in that term of office."}
{"text": "108. Manner of Presidential election"}
{"text": "The President shall be elected directly by the people by universal and secret suffrage."}
{"text": "109. Qualifications for election as President"}
{"text": "A person elected as President shall have the following qualifications:"}
{"text": "be a Maldivian citizen born to parents who are Maldivian citizens, and who is not also a citizen of a foreign country;"}
{"text": "be a Muslim and a follower of a Sunni school of Islam;"}
{"text": "be at least thirty-five years of age;"}
{"text": "be of sound mind;"}
{"text": "not have an undischarged decreed debt;"}
{"text": "not have been convicted of a criminal offence and sentenced to a term of more than twelvemonths, unless a period of three years has elapsed since his release, or pardon for the offence for which he was sentenced; and"}
{"text": "despite the provisions of article (f), not have been convicted of an offence for which a hadd is prescribed in Islam or of fraud, deception or criminal breach of trust."}
{"text": "110. Election"}
{"text": "Elections for the office of President shall be held within one hundred and twenty days to thirty days prior to the expiry of the existing presidential term."}
{"text": "111. Presidential election"}
{"text": "The President shall be elected by over fifty percent of the votes. If no candidate obtains such majority, a run-off election must be held within twenty one days after the first election. The run-off election shall be contested only by the two candidates receiving the highest number of votes in the first election. If the two candidates receiving the highest number of votes in the first election have an equal number of votes, only those two candidates shall compete in the run-off election. If there are two candidates in second position with an equal number of votes, then the run-off election shall be held among the top three candidates."}
{"text": "If any of the two candidates withdraws from the run-off election, the candidate receiving the third highest number of votes in the first election may stand for election in the run-off election."}
{"text": "The People&#x27;s Majlis shall enact a statute governing the conduct of presidential elections."}
{"text": "112. Vice President"}
{"text": "There shall be a Vice President of the Maldives who shall assist the President in the discharge of his duties and responsibilities."}
{"text": "Every candidate for President shall publicly declare the name of the Vice President who will serve with him."}
{"text": "The qualifications of office for the Vice President shall be the same as those for the President."}
{"text": "If the office of the President becomes vacant for any reason, the Vice President shall succeed to the office of the President."}
{"text": "113. Jurisdiction of the Supreme Court"}
{"text": "The Supreme Court, sitting together in session, shall have sole and final jurisdiction to determine all disputes concerning the qualification or disqualification, election, status, of a presidential candidate or running mate or removal of the President by the People&#x27;s Majlis."}
{"text": "114. Oath of office of the President and Vice President"}
{"text": "An incoming President or Vice President shall assume office upon taking and subscribing, before the Chief Justice or his designate, at a sitting of the People&#x27;s Majlis, the relevant oath of office set out in Schedule 1of this Constitution."}
{"text": "115. Powers and responsibilities of the President"}
{"text": "In addition to the duties and powers otherwise expressly conferred on the President by this Constitution and the law, the President is entrusted pursuant to this Constitution with carrying out the duties specified herein and shall have the following powers to do so:"}
{"text": "to faithfully implement the provisions of this Constitution and the law, and to promote compliance by organs of the State and by the people;"}
{"text": "to supervise the efficient and harmonious functioning of all departments of Government;"}
{"text": "to promote the rule of law, and to protect the rights and freedoms of all people;"}
{"text": "to guarantee the independence and territorial integrity of the Maldives, and to promote respect for national sovereignty in the international community;"}
{"text": "to formulate fundamental policies of the State, and to submit policies and recommendations to the appropriate agencies and institutions of Government;"}
{"text": "to appoint, dismiss and accept the resignation of members of the Cabinet, and such officials necessary for the proper functioning of the duties of his office;"}
{"text": "to preside over the Cabinet of Ministers;"}
{"text": "to issue declarations of war and peace, and to immediately submit such declarations to the People&#x27;s Majlis for approval;"}
{"text": "to declare states of emergency, in accordance with the provisions of the Constitution;"}
{"text": "to determine, conduct and oversee the foreign policy of the country, and to conduct political relations with foreign nations and international organizations;"}
{"text": "to enter into general treaties and agreements with foreign states and international organizations, which do not impose any obligations on citizens;"}
{"text": "to enter into and ratify, with the approval of the People&#x27;s Majlis, treaties and agreements with foreign states and international organizations, which impose obligations on citizens;"}
{"text": "to appoint members of diplomatic missions to foreign countries and international organizations in consultation with the People&#x27;s Majlis;"}
{"text": "to recall and remove from office members of diplomatic missions to foreign countries and international organizations;"}
{"text": "to receive and recognize the credentials of diplomatic and consular representatives of foreign countries and other parties and to accept their letters of recall;"}
{"text": "to appoint temporary commissions to advise the President on national issues and conduct investigations;"}
{"text": "to hold public referendums on issues of national importance;"}
{"text": "to declare national and government holidays;"}
{"text": "to issue awards, medals and honorary titles, as provided by law;"}
{"text": "to grant pardons or reductions of sentence as provided by law, to persons convicted of a criminal offence who have no further right of appeal;"}
{"text": "to ensure that the security services comply with their obligations as provided in this Constitution;"}
{"text": "to perform all other duties specifically authorized by this Constitution and by law."}
{"text": "116. Government Ministries"}
{"text": "The President has discretion to establish all ministries required within the Government, and shall determine their areas of jurisdiction. The President shall submit all information relating to the ministries and their areas of jurisdiction to the People&#x27;s Majlis for approval."}
{"text": "The People&#x27;s Majlis may give to the President such opinions and views it has on the ministries and their areas of jurisdiction established in accordance with article (a)."}
{"text": "117. Responsibilities of the Vice President"}
{"text": "The Vice President shall exercise such responsibilities and powers of the President as are delegated to him by the President."}
{"text": "The Vice President shall perform the responsibilities of the President if the President is absent or temporarily unable to perform the responsibilities of office."}
{"text": "118. Salary and allowances"}
{"text": "The President and Vice President shall be paid such salary and allowances as determined by the People&#x27;s Majlis."}
{"text": "119. Restrictions"}
{"text": "The President and Vice President shall not hold any other public office or office of profit, actively engage in a business or in the practice of any profession, or any other income generating employment, be employed by any person, buy or lease any property belonging to the State, or have a financial interest in any transaction between the State and any other party."}
{"text": "The President, or any person appointed or employed by him, and the Vice President, shall not use his position or any information entrusted to him by virtue of his office to improperly benefit himself or any other person."}
{"text": "120. Declaration of assets"}
{"text": "Every year, the President shall submit to the Auditor General a statement of all property and monies owned by him, business interests and all assets and liabilities."}
{"text": "121. Resignation"}
{"text": "The President may resign from office by writing under his hand submitted to the Speaker of the People&#x27;s Majlis, and the office shall become vacant when the resignation is received by the Speaker."}
{"text": "The Vice President may resign from office by writing under his hand submitted to the President, and the office shall become vacant when the resignation is received by the President."}
{"text": "122. Vacancy of office of Vice President"}
{"text": "If the office of Vice President becomes vacant by reason of death, resignation, removal from office, permanent incapacity, or succession to the office of the President, the President shall appoint a new Vice President to serve the remainder of the term. The appointment shall be approved by the People&#x27;s Majlis."}
{"text": "123. Temporary inability of the President to perform his responsibilities"}
{"text": "In the event the President believes himself temporarily unable to perform the duties and responsibilities of office, he shall inform the Speaker of the People&#x27;s Majlis in writing specifying the reasons thereof and shall handover the duties and responsibilities of his office to the Vice President. The President shall resume the responsibilities of his office after informing the Speaker of the People&#x27;s Majlis in writing."}
{"text": "In the event the President is temporarily unable to perform the duties and responsibilities of office, and is not able to inform the Speaker of the People&#x27;s Majlis in writing due to the nature of the inability, the Vice President shall with the approval of the majority of the Cabinet do so. In the event of such an occurrence, and until such time as the President is able to assume office, the responsibilities of the office of the President shall temporarily be assumed by the Vice President. The President shall resume the responsibilities of his office after informing the Speaker of the People&#x27;s Majlis in writing."}
{"text": "&nbsp;"}
{"text": "a. Temporary incapacity to carry out duties"}
{"text": "In the event of the absence or temporary incapacity of both the President and the Vice President to carry out the duties of office of the President, the duties shall be carried out, in order of priority, by the Speaker of the People&#x27;s Majlis, or by the Deputy Speaker of the People&#x27;s Majlis, or by a member of the People&#x27;s Majlis elected by a resolution of the People&#x27;s Majlis, until the President or Vice President are able to resume the duties of office."}
{"text": "b. Permanent incapacity to carry out duties"}
{"text": "In the event of the permanent incapacity, resignation, removal or death of both the President or the Vice President, and both offices becoming vacant at the same time, leading to an incapacity to carry out the duties of the President, until such time as a President and a Vice President shall be elected, the duties of both offices shall temporarily be carried out, in order of priority, by the Speaker of the People&#x27;s Majlis, or by the Deputy Speaker of the People&#x27;s Majlis, or by a member of the People&#x27;s Majlis elected by a resolution of the People&#x27;s Majlis, until successors in office are chosen."}
{"text": "c. Qualifications of person temporarily assuming office of President"}
{"text": "The qualifications of office for any person temporarily assuming the office of the President shall be the same as those for the President."}
{"text": "125. Presidential elections on the vacancy of the office of President and Vice President"}
{"text": "If any of the instances specified in Article 124 (b) of this Constitution occur and both the office of the President and the Vice President become vacant at the same time, a Presidential election shall be held within sixty days of both offices becoming vacant and appointments shall be made to both offices."}
{"text": "In the event of the occurrence of any permanent incapacity preventing the assumption of the office of President by the President elect and Vice President elect in the presidential elections, presidential elections shall be held within sixty days of such occurrence and appointments shall be made to both offices."}
{"text": "Where fresh presidential elections have to be held for any reason during the currency of an ongoing presidential term, persons elected to the office of the President or the Vice President shall only continue in office for the remainder of the ongoing presidential term. For the purposes of Article 107 of this Constitution they shall be dealt with as specified in article (c) of the said Article."}
{"text": "126. Oath of office by persons temporarily discharging the duties of the office of President and Vice President"}
{"text": "Any person temporarily discharging the duties of the office of the President or Vice President shall take and subscribe before the Chief Justice or his designate, the relevant oath of office set out in Schedule 1 of this Constitution."}
{"text": "127. Criminal accountability"}
{"text": "The President and the Vice President shall be answerable in law for any alleged criminal offence, whether committed before or during his term of office. However, if any criminal proceedings are instituted against the President, the People&#x27;s Majlis may if it so sees fit, by resolution provide that such proceedings shall not be continued until after the expiration of the term of office."}
{"text": "128. Immunity to a person who has served as the President"}
{"text": "A person who has served in the office of President, serving his term of office lawfully without committing any offence, shall be entitled to the highest honour, dignity, protection, financial privileges and other privileges entitled to a person who has served in the highest office of the land. Such protection and privileges shall be specified in law."}
{"text": "CHAPTER V. THE CABINET OF MINISTERS"}
{"text": "129. Cabinet of Ministers"}
{"text": "There shall be a Cabinet of Ministers appointed by the President, with responsibility for the duties and functions assigned to them by the President, this Constitution and the law."}
{"text": "The Cabinet shall consist of the Vice President, the Ministers given responsibility for the different Ministries, and the Attorney General."}
{"text": "Except for the Vice President, the President must receive the approval of the People&#x27;s Majlis for all appointments to the Cabinet."}
{"text": "The President shall submit to the People&#x27;s Majlis, within seven days of making appointments to the Cabinet the names of the appointees to the Cabinet for approval of the People&#x27;s Majlis."}
{"text": "130. Qualifications of Ministers"}
{"text": "A person shall be qualified to be a member of the Cabinet if he:"}
{"text": "is a citizen of the Maldives;"}
{"text": "is not a citizen of a foreign country;"}
{"text": "is a Muslim and a follower of a Sunni school of Islam;"}
{"text": "has attained the age of twenty-five years;"}
{"text": "is of sound mind."}
{"text": "A person is disqualified from being a member of the Cabinet, or a member of the Cabinet immediately becomes disqualified, if he:"}
{"text": "has a decreed debt which is not being paid as provided in the judgment; or"}
{"text": "has been convicted of a criminal offence and sentenced to a term of more than twelve months, unless a period of three years has elapsed since his release, or pardon for the offence for which he was sentenced."}
{"text": "131. Oath of office"}
{"text": "A member of the Cabinet shall assume office upon taking and subscribing, before the Chief Justice or his designate, the oath of office of members of the Cabinet set out in Schedule 1of this Constitution."}
{"text": "132. Responsibilities of the Cabinet"}
{"text": "The members of the Cabinet shall comply with all the provisions of the Constitution and the law, and shall faithfully discharge the responsibilities assigned to them by the President, including the following:"}
{"text": "to recommend to and assist the President in determining the general policies of the State, and to supervise and implement those policies in all areas of government activity, in accordance with the Constitution and the law;"}
{"text": "to advise and recommend draft bills and proposals to the President, to be prepared for submission to the People&#x27;s Majlis;"}
{"text": "to direct, review and coordinate the work of the Government;"}
{"text": "to ensure good relations and smooth functioning between the Government and other organs of the State in their areas of responsibility;"}
{"text": "to prudently and carefully manage the assets of the State within their areas of responsibility;"}
{"text": "to recommend to and assist the President in formulating the general policies of the State in relation to national and international matters, and to direct, review and coordinate the political, economic and social development of the Maldives;"}
{"text": "to promote, protect and uphold the rule of law, and defend public safety and the public interest;"}
{"text": "to perform all other duties specifically authorized by the Constitution and by law."}
{"text": "133. Attorney General"}
{"text": "The President shall appoint a person with distinguished education and experience in the legal field, who is also qualified to be a member of the Cabinet, as Attorney General. He shall be the legal advisor to the Government."}
{"text": "It is the duty of the Attorney General to advise the Government on all legal matters affecting the State. The Attorney General&#x27;s duties include performance of all legal duties pertaining to his office, and discharge of all responsibilities required to be discharged by the Attorney General, by the Constitution and by law."}
{"text": "The Attorney General has the right of audience in all courts of the Maldives, and the State shall be represented in all courts by the Attorney General or by a person delegated by him, except for those matters deemed to be the responsibility of the Prosecutor General in this Constitution."}
{"text": "The Attorney General shall have authority, with the leave of the court, to appear as a friend of the court in any civil proceedings to which the Government is not a party, where in the opinion of the Attorney General the interests of the State or the public interest dictate."}
{"text": "The Attorney General shall promote, protect, uphold and defend the rule of law, the public safety, the freedoms of the public and the public interest."}
{"text": "In the exercise of his powers, the Attorney General shall be subject only to the Constitution and the law and shall not be subject to the control or direction of any person or authority."}
{"text": "The Attorney General shall have power to issue general directives to the Prosecutor General on the conduct of criminal proceedings."}
{"text": "134. Accountability and responsibility of the Cabinet"}
{"text": "Members of the Cabinet are responsible individually and collectively to the President and also to the People&#x27;s Majlis in the manner specified by the Constitution for the proper exercise of the responsibilities and duties assigned to them."}
{"text": "Members of the Cabinet shall regularly and fairly report to the President on all matters under their jurisdiction, and shall provide to the People&#x27;s Majlis information about matters under their jurisdiction when requested to do so."}
{"text": "135. Salary and allowances"}
{"text": "The members of the Cabinet shall be paid such salary and allowances as determined by the People&#x27;s Majlis."}
{"text": "136. Restrictions"}
{"text": "A member of the Cabinet shall not hold any other public office or office of profit, actively engage in a business or in the practice of any profession, or any other income generating employment, be employed by any person, buy or lease any property belonging to the State, or have a financial interest in any transaction between the State and another party."}
{"text": "A member of the Cabinet shall not use his position or any information entrusted to him by virtue of his office to improperly benefit himself or any other person."}
{"text": "137. Dismissal"}
{"text": "The President may at his discretion remove any member of the Cabinet from office by writing under his hand addressed to such member."}
{"text": "Despite the provisions of article (a), the President does not have the discretion to remove the Vice President from office."}
{"text": "138. Declaration of assets"}
{"text": "Every member of the Cabinet shall annually submit to the Auditor General a statement of all property and monies owned by him, business interests and all assets and liabilities."}
{"text": "139. Resignation"}
{"text": "A member of the Cabinet may resign from office by writing under his hand submitted to the President, and the office shall become vacant when the resignation is received by the President."}
{"text": "140. A minister to be responsible for each government authority"}
{"text": "A member of the Cabinet shall be given responsibility for each authority or institute established by the Government or the People&#x27;s Majlis, except for independent institutions specified in this Constitution or established pursuant to law. Such member of the Cabinet must take responsibility for the operation of such authority or institution and must be accountable for it."}
{"text": "CHAPTER VI. THE JUDICIARY"}
{"text": "141. Judiciary"}
{"text": "The judicial power is vested in the Supreme Court, the High Court, and such Trial Courts as established by law."}
{"text": "The Supreme Court shall be the highest authority for the administration of justice in the Maldives. The Chief Justice shall be the highest authority on the Supreme Court. All matters adjudicated before the Supreme Court shall be decided upon by a majority of the judges sitting together in session."}
{"text": "No officials performing public functions, or any other persons, shall interfere with and influence the functions of the courts."}
{"text": "Persons or bodies performing public functions, through legislative and other measures, must assist and protect the courts to ensure the independence, eminence, dignity, impartiality, accessibility and effectiveness of the courts."}
{"text": "142. Compliance with law"}
{"text": "The Judges are independent, and subject only to the Constitution and the law. When deciding matters on which the Constitution or the law is silent, Judges must consider Islamic Shari&#x27;ah. In the performance of their judicial functions, Judges must apply the Constitution and the law impartially and without fear, favour or prejudice."}
{"text": "143. Jurisdiction of the courts"}
{"text": "The Supreme Court and the High Court shall have jurisdiction to enquire into and rule on the constitutional validity of any statute or part thereof enacted by the People&#x27;s Majlis."}
{"text": "In any matter before them, all courts have jurisdiction to determine matters concerning the interpretation and application of any provision of the Constitution, and this shall not be deemed contrary to article (a)."}
{"text": "Every court has jurisdiction to overturn the decision of a lower court."}
{"text": "Lower courts shall follow the decisions of a higher court."}
{"text": "144. Powers in constitutional matters"}
{"text": "When deciding a constitutional matter within its jurisdiction, a court:"}
{"text": "may declare that any statute, regulation or part thereof, order, decision or action of any person or body performing a public function that is inconsistent with the Constitution is invalid to the extent of the inconsistency; and"}
{"text": "may in connection with a declaration pursuant to article (b) make any order that is just and equitable, including:"}
{"text": "an order providing just compensation for any damage sustained by any person or group of persons due to any statute, regulation or action that is inconsistent with the Constitution; or"}
{"text": "an order suspending the declaration of invalidity (of a statute, regulation or action due to inconsistency with the Constitution) for any period and on any conditions, to allow the competent authority to correct the defect:"}
{"text": "may make an order limiting the retrospective effect of a declaration of invalidity of a statute, regulation or part thereof, order, decision or action of any person or body performing a public function that is inconsistent with the Constitution."}
{"text": "145. Supreme Court"}
{"text": "The Supreme Court shall consist of the Chief Justice and such number of Judges as provided by law. The Supreme Court shall consist of an uneven number of Judges."}
{"text": "Matters shall be disposed of in the Supreme Court by an uneven number of Judges sitting together in session."}
{"text": "The Supreme Court shall be the final authority on the interpretation of the Constitution, the law, or any other matter dealt with by a court of law."}
{"text": "146. High Court"}
{"text": "The High Court shall consist of such number of Judges as provided by law."}
{"text": "Matters shall be disposed of in the High Court by an uneven number of Judges sitting together in session."}
{"text": "147. Appointment of the Chief Justice"}
{"text": "There shall be a Chief Justice of the Maldives. The President as the Head of State shall appoint the Chief Justice, after consulting the Judicial Service Commission and confirmation of the appointee by a majority of the members of the People&#x27;s Majlis present and voting."}
{"text": "148. Appointment of Judges"}
{"text": "The President as the Head of State shall appoint the Judges of the Supreme Court, after consulting the Judicial Service Commission and confirmation of the appointees by a majority of the members of the People&#x27;s Majlis present and voting."}
{"text": "All other Judges shall be appointed by the Judicial Service Commission, to be established in accordance with the provisions of this Constitution."}
{"text": "Judges shall be appointed without term, but shall retire at the age of seventy years."}
{"text": "Notwithstanding article (c), for a period of fifteen years from the commencement of the Constitution, Judges may be appointed for a fixed term of not more than five years, as specified in the terms of their appointment."}
{"text": "149. Qualifications of Judges"}
{"text": "A person appointed as a Judge in accordance with law, must possess the educational qualifications, experience and recognized competence necessary to discharge the duties and responsibilities of a Judge, and must be of high moral character."}
{"text": "In addition to the qualifications specified in article (a), a Judge shall possess the following qualifications:-"}
{"text": "be a Muslim and a follower of a Sunni school of Islam;"}
{"text": "be twenty-five years of age;"}
{"text": "has not been convicted of an offence for which a hadd is prescribed in Islam, criminal breach of trust, or bribery;"}
{"text": "be of sound mind."}
{"text": "A person appointed to be a Judge of the Supreme Court, shall be at least thirty years of age; possess at least seven years experience as a Judge or practicing lawyer or both as a Judge and a practicing lawyer, and must be educated in Islamic Shari&#x27;ah or law."}
{"text": "The People&#x27;s Majlis shall pass a statute relating to Judges."}
{"text": "150. Oath of office of Judges"}
{"text": "Every Judge shall take and subscribe the oath of office of Judges set out in Schedule 1 of this Constitution before assuming office."}
{"text": "151. Full time performance"}
{"text": "Every Judge shall devote his full time to the performance of the responsibilities of a Judge. A Judge shall perform other work only in accordance with and as specified by the statute relating to Judges."}
{"text": "152. Salary and allowances"}
{"text": "Judges shall be paid such salary and allowances in keeping with the stature of their office as determined by the People&#x27;s Majlis."}
{"text": "153. Declaration of assets"}
{"text": "Every Judge shall annually submit to the Judicial Service Commission a statement of all property and monies owned by him, business interests and all assets and liabilities."}
{"text": "154. Tenure and removal"}
{"text": "A Judge shall not be removed from office during good behavior and compliance with judicial ethics."}
{"text": "A Judge may be removed from office only if the Judicial Service Commission finds that the person is grossly incompetent, or that the Judge is guilty of gross misconduct, and submits to the People&#x27;s Majlis a resolution supporting the removal of the Judge, which is passed by a two-thirds majority of the members of the People&#x27;s Majlis present and voting."}
{"text": "155. Power to determine the jurisdiction of courts and to enact administrative laws relating to the courts"}
{"text": "The People&#x27;s Majlis shall have authority to pass laws concerning the administration of the courts, the trial and appellate jurisdiction of the courts and trial procedures."}
{"text": "156. Administration of the courts"}
{"text": "The courts have the inherent power to protect and regulate their own process, in accordance with law and the interests of justice."}
{"text": "CHAPTER VII. INDEPENDENT COMMISSIONS AND OFFICES"}
{"text": "Part 1. JUDICIAL SERVICE COMMISSION"}
{"text": "157. Judicial Service Commission"}
{"text": "There shall be a Judicial Service Commission of the Maldives."}
{"text": "The Judicial Service Commission is an independent and impartial institution. It shall perform its duties and responsibilities in accordance with the Constitution and any laws enacted by the People&#x27;s Majlis. The jurisdiction of the Judicial Service Commission shall extend to all members of the Judiciary and such other persons as designated by the People&#x27;s Majlis."}
{"text": "The Judicial Service Commission shall function as provided by the statute governing the Judicial Service Commission. Such statute shall specify the responsibilities, powers, mandate, qualifications, and ethical standards of members."}
{"text": "158. Composition of the Judicial Service Commission"}
{"text": "The Judicial Service Commission shall consist of:"}
{"text": "the Speaker of the People&#x27;s Majlis;"}
{"text": "a Judge of the Supreme Court other than the Chief Justice, elected by the Judges of the Supreme Court;"}
{"text": "a Judge of the High Court, elected by the Judges of the High Court;"}
{"text": "a Judge of the Trial Courts, elected by the Judges of the Trial Court;"}
{"text": "a member of the People&#x27;s Majlis appointed by it;"}
{"text": "a member of the general public appointed by the People&#x27;s Majlis;"}
{"text": "the Chair of the Civil Service Commission;"}
{"text": "a person appointed by the President;"}
{"text": "the Attorney General;"}
{"text": "a lawyer elected from among the lawyers licensed to practise in the Maldives by themselves."}
{"text": "159. Responsibilities and powers"}
{"text": "The Judicial Service Commission is entrusted with the responsibility and power:"}
{"text": "to appoint, promote and transfer Judges other than the Chief Justice and Judges of the Supreme Court, and to make recommendations to the President on the appointment of the Chief Justice and Judges of the Supreme Court;"}
{"text": "to investigate complaints about the Judiciary, and to take disciplinary action against them, including recommendations for dismissal;"}
{"text": "to make rules:"}
{"text": "regarding schemes for recruitment and procedures for the appointment of Judges;"}
{"text": "ethical standards of Judges;"}
{"text": "providing for such matters as are necessary or expedient for the exercise, performance and discharge of the duties and responsibilities of the Commission;"}
{"text": "to advise the President and the People&#x27;s Majlis on any other matter relating to the Judiciary or the administration of justice;"}
{"text": "to exercise such additional powers and functions prescribed by this Constitution or by law."}
{"text": "160. Constituting the Judicial Service Commission"}
{"text": "The President as Head of the State shall constitute the Judicial Service Judicial Service Commission as specified in this Chapter."}
{"text": "161. Term of office of members of the Judicial Service Commission"}
{"text": "A member of the Judicial Service Commission:"}
{"text": "appointed pursuant to Article 158 (b), (c), (d), (e), (f), (h) or (j), holds office for a term of five years and is not eligible for reappointment;"}
{"text": "appointed by virtue of the office he held pursuant to Article 158 (a), (g), or (i) remains a member of the Judicial Service Commission only as long as that office is held."}
{"text": "162. Resignation from membership of the Judicial Service Commission"}
{"text": "A member of the Judicial Service Commission may resign from office by writing under his hand addressed to the President, and the office shall become vacant when the resignation is received by the President. A member appointed under Articles 158 (a), (g), or (i) may not resign pursuant to this Article."}
{"text": "163. Quorum and voting"}
{"text": "A majority of the members shall constitute a quorum at a meeting of the Judicial Service Commission, and any decision of the Judicial Service Commission shall be taken by a majority of votes of the members present and voting."}
{"text": "164. Salary and allowances"}
{"text": "A member of the Judicial Service Commission who is not a member of the Executive, the Judiciary, or the People&#x27;s Majlis shall be paid such salary and allowances as may be determined by the People&#x27;s Majlis."}
{"text": "165. Removal from office"}
{"text": "A member of the Judicial Service Commission appointed pursuant to Article 158 (b), (c), (d), (e), (f), (h) or (j), may be removed from office by the appoint or. Members of the Judicial Service Commission appointed by virtue of the office held pursuant to Articles 158 (a), (g), or (i) shall be removed from membership of the Judicial Service Commission upon vacation of the office he holds."}
{"text": "166. Oath of office"}
{"text": "Every member of the Judicial Service Commission shall take and subscribe the oath of office of members of the Judicial Service Commission set out in Schedule 1 of this Constitution before assuming office."}
{"text": "Part 2. ELECTIONS COMMISSION"}
{"text": "167. Elections Commission"}
{"text": "There shall be an Elections Commission of the Maldives."}
{"text": "The Elections Commission is an independent and impartial institution. It shall exercise its duties and responsibilities in accordance with the Constitution and laws enacted by the People&#x27;s Majlis."}
{"text": "The Elections Commission shall function as provided by the statute governing the Elections Commission. Such statute shall specify the responsibilities, powers, mandate, qualifications, and ethical standards of members."}
{"text": "168. Appointment and composition of the Elections Commission"}
{"text": "The Elections Commission shall comprise of at least five members including the Chairman of the Commission."}
{"text": "The President shall appoint to the Elections Commission those persons approved by a majority of the People&#x27;s Majlis from the names submitted to the People&#x27;s Majlis as provided for in the statute governing the Elections Commission."}
{"text": "169. Qualifications"}
{"text": "To be qualified for appointment to the Elections Commission, a person shall possess the educational qualifications, experience and recognized competence necessary to discharge the functions of the Elections Commission. Members of the Elections Commission shall not engage in any other employment."}
{"text": "170. Responsibilities and powers"}
{"text": "The Elections Commission&#x27;s responsibilities and powers include the following:"}
{"text": "to conduct, manage, supervise, and facilitate all elections and public referendums, to ensure the proper exercise of the right to vote, and to ensure that all elections and public referendums are conducted freely and fairly, without intimidation, aggression, undue influence or corruption;"}
{"text": "to prepare, maintain, and update electoral rolls, and to make all arrangements for holding elections and public referendums;"}
{"text": "to hold and declare the results of those elections and public referendums within periods prescribed by law;"}
{"text": "to compile the register of voters in each constituency, to revise it at such periods as shall be determined by law and to provide for publication of the register in the Government Gazette;"}
{"text": "to fix, vary, demarcate and continuously review the boundaries and names of constituencies or voting units in all elections in accordance with principles specified by law and to provide for publication of any amendments in the Government Gazette;"}
{"text": "to register political parties, and to perform those actions relating to political parties as specified by law;"}
{"text": "to educate and create awareness among the general public on the electoral process and its purpose;"}
{"text": "to perform such additional functions as may be prescribed by law."}
{"text": "171. Voting and recording of results"}
{"text": "Voting in all public elections or public referendums conducted by the Elections Commission, shall be by secret ballot."}
{"text": "Immediately after the close of the polls, the presiding officer who is appointed by the Elections Commission shall, in the presence of such candidates or their representatives if present, and any other persons authorized by law to be present, count at that polling station the ballot papers of that station, and record and publicly declare the votes cast in favour of each candidate or question in a public referendum."}
{"text": "172. Elections petitions"}
{"text": "A person may challenge a decision of the Elections Commission concerning an election or a public referendum, or may challenge the results of an election, or contest the legality of any other matter related to an election, by means of an election petition presented to the High Court."}
{"text": "The manner for dealing with any challenge submitted pursuant to article (a) shall be provided for in a statute on elections."}
{"text": "173. Term of office of members of the Elections Commission"}
{"text": "A member of the Elections Commission shall be appointed for one term of five years. The People&#x27;s Majlis can approve the renewal of the appointment for an additional term of not more than five years."}
{"text": "174. Resignation from membership of the Elections Commission"}
{"text": "A member of the Elections Commission may resign from office by writing under his hand addressed to the President, and the office shall become vacant when the resignation is received by the President."}
{"text": "175. Quorum and voting"}
{"text": "A majority of the members of the Elections Commission shall constitute a quorum at a meeting of the Elections Commission, and any decision of the Elections Commission shall be taken by a majority of votes of the members present and voting."}
{"text": "176. Salary and allowances"}
{"text": "The members of the Elections Commission shall be paid such salary and allowances as determined by the People&#x27;s Majlis."}
{"text": "177. Removal from office"}
{"text": "A member of the Elections Commission shall be removed from office only for the reasons specified in article (a), and in the manner specified in article (b):"}
{"text": "on the ground of misconduct, incapacity or incompetence; and"}
{"text": "a finding to that effect by a committee of the People&#x27;s Majlis pursuant to article (a), and upon the approval of such finding by the People&#x27;s Majlis by a majority of those present and voting, calling for the member&#x27;s removal from office, such member shall be deemed removed from office."}
{"text": "178. Oath of office"}
{"text": "Every member of the Elections Commission shall take and subscribe the oath of office of members of the Elections Commission set out in Schedule 1 of this Constitution before assuming office."}
{"text": "Part 3. CIVIL SERVICE COMMISSION"}
{"text": "179. Civil Service Commission"}
{"text": "There shall be a Civil Service Commission of the Maldives."}
{"text": "The Civil Service Commission is an independent and impartial institution. It shall perform its duties and responsibilities in accordance with the Constitution and any laws enacted by the People&#x27;s Majlis. The Civil Service Commission shall strive to achieve and maintain an effective and efficient civil service with high standards of professional ethics."}
{"text": "The Civil Service Commission shall function as provided by the statute governing the Civil Service Commission. Such statute shall specify the responsibilities, powers, mandate, qualifications, and ethical standards of members."}
{"text": "180. Appointment and composition of the Civil Service Commission"}
{"text": "The Civil Service Commission shall comprise of at least five members including the Chairman of the Commission."}
{"text": "The President shall appoint to the Civil Service Commission those persons approved by a majority of the members of the People&#x27;s Majlis present and voting, from the names submitted to the People&#x27;s Majlis as provided for in the statute governing the Civil Service Commission."}
{"text": "181. Qualifications"}
{"text": "To be qualified for appointment to the Civil Service Commission, a person shall possess the educational qualifications, experience and recognized competence necessary to discharge the functions of the Civil Service Commission. Members of the Civil Service Commission shall not engage in any other employment."}
{"text": "182. Responsibilities and powers"}
{"text": "The Civil Service Commission&#x27;s responsibilities and powers include the following:"}
{"text": "to recruit, appoint, promote, transfer and dismiss the members of the Civil Service, as defined by law;"}
{"text": "to establish uniform standards of organization and administration within the Civil Service;"}
{"text": "to formulate measures to ensure effective and efficient performance within the Civil Service;"}
{"text": "to establish personnel procedures relating to recruitment, appointments, transfers, promotions and dismissals;"}
{"text": "to report to the Executive and to the People&#x27;s Majlis on its activities and the performance of its functions, including personnel policies, findings, directions and advice it may give, and an evaluation of the extent to which the values and principles set out in article (b) are complied with;"}
{"text": "to exercise or perform such additional powers and responsibilities prescribed bylaw."}
{"text": "In carrying out its powers and functions, the Civil Service Commission shall be governed by democratic values and principles, including the following:"}
{"text": "a high standard of professional ethics shall be promoted and maintained;"}
{"text": "efficient, economic and effective use of resources shall be promoted;"}
{"text": "services shall be provided impartially, fairly, equitably and without prejudice;"}
{"text": "the needs of the public shall be responded to, and the public shall be encouraged to participate in policy-making;"}
{"text": "the accountability of the Civil Service to all branches of the State and to the public;"}
{"text": "transparency shall be fostered by providing the public with timely, accessible and accurate information;"}
{"text": "good human-resource management and career-development practices to maximise human potential shall be cultivated;"}
{"text": "employment and personnel management practices shall be based on ability, analysis of determined principles and fairness;"}
{"text": "no member of the Civil Service may be favoured or prejudiced only because of support for or opposition to a particular political party or cause;"}
{"text": "no member of the Civil Service shall use his position or any information entrusted to him to improperly benefit himself or any other person."}
{"text": "183. Term of office of members of the Civil Service Commission"}
{"text": "A member of the Civil Service Commission shall be appointed for one term of five years. The People&#x27;s Majlis can approve the renewal of the appointment for an additional term of not more than five years."}
{"text": "184. Resignation from membership of the Civil Service Commission"}
{"text": "A member of the Civil Service Commission may resign from office by writing under his hand addressed to the President, and the office shall become vacant when the resignation is received by the President."}
{"text": "185. Quorum and voting"}
{"text": "A majority of the members of the Civil Service Commission shall constitute a quorum at a meeting of the Civil Service Commission, and any decision of the Civil Service Commission shall be taken by a majority of votes of the members present and voting."}
{"text": "186. Salary and allowances"}
{"text": "The members of the Civil Service Commission shall be paid such salary and allowances as may be determined by the People&#x27;s Majlis."}
{"text": "187. Removal from office"}
{"text": "A member of the Civil Service Commission shall be removed from office only for the reasons specified in article (a), and in the manner specified in article (b):"}
{"text": "on the ground of misconduct, incapacity or incompetence; and"}
{"text": "a finding to that effect by a committee of the People&#x27;s Majlis pursuant to article (a), and upon the approval of such finding by the People&#x27;s Majlis by a majority of those present and voting, calling for the member&#x27;s removal from office, such member shall be deemed removed from office."}
{"text": "188. Oath of office"}
{"text": "Every member of the Civil Service Commission shall take and subscribe the oath of office of members of the Civil Service Commission set out in Schedule 1 before assuming office."}
{"text": "Part 4. HUMAN RIGHTS COMMISSION"}
{"text": "189. Human Rights Commission"}
{"text": "There shall be a Human Rights Commission of the Maldives."}
{"text": "The Human Rights Commission is an independent and impartial institution. It shall promote respect for human rights impartially without favour and prejudice."}
{"text": "The Human Rights Commission shall function as provided by the statute governing the Human Rights Commission. Such statute shall specify the responsibilities, powers, mandate, qualifications, and ethical standards of members."}
{"text": "190. Appointment and composition of the Human Rights Commission"}
{"text": "The Human Rights Commission shall comprise of at least five members including the Chairman of the Commission."}
{"text": "The President shall appoint to the Human Rights Commission those persons approved by a majority of the members of the People&#x27;s Majlis from the names submitted to the People&#x27;s Majlis as provided for in the statute governing the Human Rights Commission."}
{"text": "191. Qualifications"}
{"text": "To be qualified for appointment to the Human Rights Commission, a person shall possess the educational qualifications, experience and recognized competence necessary to discharge the functions of the Human Rights Commission. Members of the Elections Commission shall not engage in any other employment."}
{"text": "192. Responsibilities and powers"}
{"text": "The Human Rights Commission&#x27;s responsibilities and powers shall include the following:"}
{"text": "to promote respect for human rights;"}
{"text": "to promote the protection, development and attainment of human rights;"}
{"text": "to monitor and assess the observance of human rights."}
{"text": "The Human Rights Commission shall have the following functions and powers, as regulated bylaw:"}
{"text": "to investigate and to report on the observance of human rights;"}
{"text": "to take steps to secure appropriate redress where human rights have been violated;"}
{"text": "to carry out research, and to educate the public;"}
{"text": "to exercise such additional powers and functions prescribed by law."}
{"text": "193. Term of office of members of the Human Rights Commission"}
{"text": "A member of the Human Rights Commission shall be appointed for one term of five years. The People&#x27;s Majlis can approve the renewal of the appointment for an additional term of not more than five years."}
{"text": "194. Resignation from membership of the Human Rights Commission"}
{"text": "A member of the Human Rights Commission may resign from office by writing under his hand addressed to the President, and the office shall become vacant when the resignation is received by the President."}
{"text": "195. Quorum and voting"}
{"text": "A majority of the members of the Human Rights Commission shall constitute a quorum at a meeting of the Human Rights Commission, and any decision of the Human Rights Commission shall be taken by a majority of votes of the members present and voting."}
{"text": "196. Salary and allowances"}
{"text": "The members of the Human Rights Commission shall be paid such salary and allowances as determined by the People&#x27;s Majlis."}
{"text": "197. Removal from office"}
{"text": "A member of the Human Rights Commission shall be removed from office only for the reasons specified in article (a) and in the manner specified in article (b):"}
{"text": "on the ground of misconduct, incapacity or incompetence; and"}
{"text": "a finding to that effect by a committee of the People&#x27;s Majlis pursuant to article (a), and upon the approval of such finding by the People&#x27;s Majlis by a majority of those present and voting, calling for the member&#x27;s removal from office, such member shall be deemed removed from office."}
{"text": "198. Oath of office"}
{"text": "Every member of the Human Rights Commission shall take and subscribe the oath of office of members of the Human Rights Commission set out in Schedule 1 of this Constitution before assuming office."}
{"text": "Part 5. ANTI-CORRUPTION COMMISSION"}
{"text": "199. Anti-Corruption Commission"}
{"text": "There shall be an Anti-Corruption Commission of the Maldives."}
{"text": "The Anti-Corruption Commission is an independent and impartial institution. It shall perform its duties and responsibilities in accordance with the Constitution and any laws enacted by the People&#x27;s Majlis. The Anti-Corruption Commission shall work to prevent and combat corruption within all activities of the State without fear."}
{"text": "The Anti-Corruption Commission shall function as provided for by the statute governing the Anti-Corruption Commission. Such statute shall specify the responsibilities, powers, mandate, qualifications, and ethical standards of members."}
{"text": "The statute governing the Anti-Corruption Commission shall provide a definition of corruption."}
{"text": "200. Appointment and composition of the Anti-Corruption Commission"}
{"text": "The Anti-Corruption Commission shall comprise of at least five members including the Chairman of the Commission."}
{"text": "The President shall appoint to the Anti-Corruption Commission those persons approved by a majority of the members of the People&#x27;s Majlis present and voting, from the names submitted to the People&#x27;s Majlis as provided for in the statute governing the Anti-Corruption Commission."}
{"text": "201. Qualifications"}
{"text": "To be qualified for appointment to the Anti-Corruption Commission, a person shall possess the educational qualifications, experience and recognized competence necessary to discharge the functions of the Anti-Corruption Commission. Members of the Anti-Corruption Commission shall not engage in any other employment."}
{"text": "202. Responsibilities and powers"}
{"text": "The Anti-Corruption Commission&#x27;s responsibilities and powers include the following:"}
{"text": "to inquire into and investigate all allegations of corruption; any complaints, information, or suspicion of corruption must be investigated;"}
{"text": "to recommend further inquiries and investigations by other investigatory bodies, and to recommend prosecution of alleged offences to the Prosecutor General, where warranted;"}
{"text": "to carry out research on the prevention of corruption and to submit recommendations for improvement to relevant authorities regarding actions to be taken;"}
{"text": "to promote the values of honesty and integrity in the operations of the State, and to promote public awareness of the dangers of corruption;"}
{"text": "to perform any additional duties or functions specifically provided by law for the prevention of corruption."}
{"text": "203. Term of office of members of the Anti-Corruption Commission"}
{"text": "A member of the Anti-Corruption Commission shall be appointed for one term of five years. The People&#x27;s Majlis can approve the renewal of the appointment for an additional term of not more than five years."}
{"text": "204. Resignation from the Anti-Corruption Commission"}
{"text": "A member of the Anti-Corruption Commission may resign from office by writing under his hand addressed to the President, and the office shall become vacant when the resignation is received by the President."}
{"text": "205. Quorum and voting"}
{"text": "A majority of the members of the Anti-Corruption Commission shall constitute a quorum at a meeting of the Anti-Corruption Commission, and any decision of the Anti-Corruption Commission shall be taken by a majority of votes of the members present and voting."}
{"text": "206. Salary and allowances"}
{"text": "The members of the Anti-Corruption Commission shall be paid such salary and allowances as determined by the People&#x27;s Majlis."}
{"text": "207. Removal from office"}
{"text": "A member of the Anti-Corruption Commission shall be removed from office only for the reasons specified in article (a) and in the manner specified in article (b):"}
{"text": "on the ground of misconduct, incapacity or incompetence; and"}
{"text": "a finding to that effect by a committee of the People&#x27;s Majlis pursuant to article (a), and upon the approval of such finding by the People&#x27;s Majlis by a majority of those present and voting, calling for the member&#x27;s removal from office, such member shall be deemed removed from office."}
{"text": "208. Oath of office"}
{"text": "Every member of the Anti-Corruption Commission shall take and subscribe the oath of office of members of the Anti-Corruption Commission set out in Schedule1of this Constitution before assuming office."}
{"text": "Part 6. AUDITOR GENERAL"}
{"text": "209. Auditor General"}
{"text": "There shall be an independent and impartial Auditor General of the Maldives."}
{"text": "The Auditor General shall carry out his responsibilities and duties in accordance with the Constitution and any laws passed by the People&#x27;s Majlis."}
{"text": "210. Appointment of Auditor General"}
{"text": "The President shall appoint as Auditor General a person approved by a majority of the total membership of the People&#x27;s Majlis from the names submitted to the People&#x27;s Majlis as provided for in law."}
{"text": "211. Qualifications of Auditor General"}
{"text": "To be qualified for appointment as Auditor General, a person shall possess the educational qualifications, experience and recognized competence necessary to discharge the responsibilities of the Auditor General. The Auditor General shall not engage in any other employment."}
{"text": "A statute shall specify the responsibilities, powers, mandate, qualifications, and ethical standards of the Auditor General."}
{"text": "212. Responsibilities and powers"}
{"text": "The Auditor General&#x27;s responsibilities and powers include the following: -"}
{"text": "audit, the accounts, financial statements and financial management and prepare and publish reports on:"}
{"text": "all Government ministries;"}
{"text": "departments operating under Government ministries;"}
{"text": "other government agencies and offices;"}
{"text": "all offices and organisations operating under the legislative authority;"}
{"text": "Independent Commissions and Independent Offices established in accordance with the Constitution and law, and all offices operating under the same;"}
{"text": "all offices and organisations operating under the judicial authority;"}
{"text": "in addition to the institutions specified in article(a) any other institution or organisation required by law to be audited by the Auditor General."}
{"text": "Subject to law, the Auditor General may audit, report on and publish the accounts, financial statements and financial management of:"}
{"text": "any institution primarily funded by the State;"}
{"text": "any business entity, in which shares are owned by the State."}
{"text": "213. Reporting"}
{"text": "The Auditor General shall submit audit reports and an annual report to the President and the People&#x27;s Majlis, and to any other authority prescribed by law."}
{"text": "214. Audit of the Auditor General’s office"}
{"text": "The office of the Auditor General shall be audited as specified in law."}
{"text": "215. Term of office of the Auditor General"}
{"text": "The Auditor General shall be appointed for one term of seven years. The appointment may be renewed for an additional term of not more than five years in accordance with the statute relating to the Auditor General, by a resolution passed by a majority of the total membership of the People&#x27;s Majlis."}
{"text": "216. Resignation of Auditor General"}
{"text": "The Auditor General may resign from office by writing under his hand addressed to the President, and the office shall become vacant when the resignation is received by the President."}
{"text": "217. Salary and allowances"}
{"text": "The Auditor General shall be paid such salary and allowances as determined by the People&#x27;s Majlis."}
{"text": "218. Removal from office"}
{"text": "The Auditor General shall be removed from office only for the reasons specified in article (a) and in the manner specified in article (b):"}
{"text": "on the ground of misconduct, incapacity or incompetence; and"}
{"text": "a finding to that effect by a committee of the People&#x27;s Majlis, pursuant to article (a) and upon the approval of such finding by the People&#x27;s Majlis by a majority of those present and voting, calling for the Auditor General&#x27;s removal from office, the Auditor General shall be deemed removed from office."}
{"text": "219. Oath of office"}
{"text": "The Auditor General shall take and subscribe the oath of office of the Auditor General set out in Schedule 1 of this Constitution before assuming office."}
{"text": "Part 7. PROSECUTOR GENERAL"}
{"text": "220. Prosecutor General"}
{"text": "There shall be an independent and impartial Prosecutor General of the Maldives."}
{"text": "The Prosecutor General shall carry out his responsibilities and duties in accordance with the Constitution and any laws passed by the People&#x27;s Majlis."}
{"text": "The Prosecutor General is independent and impartial, and he shall not be under the direction or control of any person or authority in carrying out his responsibilities and the exercise of his powers. He shall carry out his responsibilities and exercise his powers without fear, favour or prejudice, subject only to the general policy directives of the Attorney General, and on the basis of fairness, transparency, and accountability."}
{"text": "221. Appointment of Prosecutor General"}
{"text": "The President shall appoint as Prosecutor General a person approved by a majority of the total membership of the People&#x27;s Majlis from the names submitted to the People&#x27;s Majlis as provided for in law."}
{"text": "222. Qualifications of Prosecutor General"}
{"text": "To be qualified for appointment as Prosecutor General, a person shall possess the educational qualifications, experience and recognized competence necessary to discharge the responsibilities of the Prosecutor General. The Prosecutor General shall not engage in any other employment."}
{"text": "223. Responsibilities and powers of the Prosecutor General"}
{"text": "The Prosecutor General&#x27;s responsibilities and powers include the following: -"}
{"text": "to supervise the prosecution of all criminal offences in the Maldives;"}
{"text": "to consider and assess evidence presented by investigating bodies to determine whether charges should be pursued;"}
{"text": "to institute and conduct criminal proceedings against any person before any court in respect of any alleged offence;"}
{"text": "to oversee the legality of preliminary inquiries and investigations into alleged criminal activity;"}
{"text": "to monitor and review the circumstances and conditions under which any person is arrested, detained or otherwise deprived of freedom prior to trial;"}
{"text": "to order any investigation that he deems desirable into complaints of criminal activity or into any other criminal activity of which he becomes aware;"}
{"text": "to take over, review and continue any criminal proceedings instituted by any prosecuting body authorized to initiate prosecutions pursuant to a law enacted by the People&#x27;s Majlis, and at his discretion to discontinue any criminal proceedings at any stage prior to judgment;"}
{"text": "to review or revert any decision to prosecute or not to prosecute any alleged offender, or to discontinue any prosecution;"}
{"text": "to appeal any judgment, verdict or decision in a criminal matter;"}
{"text": "to issue policy directives which shall be observed in the entire prosecutorial process;"}
{"text": "to uphold the constitutional order, the law, and the rights and freedoms of all citizens."}
{"text": "224. Acting through agents"}
{"text": "The responsibilities and powers of the Prosecutor General may be assigned with his express instructions, to any person working under his mandate or to any other person."}
{"text": "225. Term of office of the Prosecutor General"}
{"text": "The Prosecutor General shall be appointed for one term of five years. The People&#x27;s Majlis can approve the renewal of the appointment for an additional term of not more than five years in accordance with the statute relating to the Prosecutor General."}
{"text": "226. Resignation of Prosecutor General"}
{"text": "The Prosecutor General may resign from office by writing under his hand addressed to the President, and the office shall become vacant when the resignation is received by the President."}
{"text": "227. Salary and allowances"}
{"text": "The Prosecutor General shall be paid such salary and allowances as determined by the People&#x27;s Majlis."}
{"text": "228. Removal from office"}
{"text": "The Prosecutor General shall be removed from office only for the reasons specified in article (a) and in the manner specified in article (b):"}
{"text": "on the ground of misconduct, incapacity or incompetence; and"}
{"text": "a finding to that effect by a committee of the People&#x27;s Majlis, pursuant to article (a) and upon the approval of such finding by the People&#x27;s Majlis by a majority of those present and voting, calling for the Prosecutor General&#x27;s removal from office, the Prosecutor General shall be deemed removed from office."}
{"text": "229. Oath of office"}
{"text": "The Prosecutor General shall take and subscribe the oath of office of the Prosecutor General set out in Schedule 1of this Constitution before assuming office."}
{"text": "CHAPTER VIII. DECENTRALISED ADMINISTRATION"}
{"text": "230. Decentralised administration"}
{"text": "The administrative divisions of the Maldives shall be administered decentrally."}
{"text": "In order to provide for decentralised administration, the President has the power, as provided in law, to create constituencies, posts, island councils, atoll councils and city councils."}
{"text": "The jurisdiction and characteristics of constituencies, posts and councils created to provide for decentralised administration shall be specified in law."}
{"text": "231. Election of Councils"}
{"text": "All members of councils created for decentralised administration shall be democratically elected by their respective communities by secret ballot."}
{"text": "The President and the Vice President of the councils elected to administer the administrative divisions shall be elected from among the members of each council by secret ballot of the members."}
{"text": "The term of councils elected to administer the constituencies shall not exceed three years."}
{"text": "The People&#x27;s Majlis shall enact a statute governing the election of members of councils created for decentralised administration."}
{"text": "The elections of councils created for decentralised administration shall be conducted by the Elections Commission."}
{"text": "232. Responsibilities"}
{"text": "The responsibilities of councils elected to provide for decentralised administration shall include:"}
{"text": "to provide democratic and accountable governance;"}
{"text": "to foster the social and economic well-being and development of the community;"}
{"text": "to establish a safe, healthy and ecologically diverse environment;"}
{"text": "to achieve such other objects as prescribed bylaw."}
{"text": "233. Authority to enact subordinate legislation"}
{"text": "A bylaw or decision of a local authority shall be subject to Acts or Regulation of the People&#x27;s Majlis."}
{"text": "234. Finance"}
{"text": "Local authorities shall be provided with an annual budget from the Treasury as provided in law, and shall also have authority, in accordance with statute, to raise funds."}
{"text": "235. Ownership of property and liability for debts"}
{"text": "Local authorities shall be empowered to own property and to incur liabilities, subject to any limitations prescribed by statute."}
{"text": "CHAPTER IX. SECURITY SERVICES"}
{"text": "236. Security services"}
{"text": "The Maldivian security services, consisting of the Military Service and the Police Service, is established to enable all persons in the Maldives to live in peace, security and freedom."}
{"text": "237. Responsibilities and duties"}
{"text": "The security services shall protect the nation&#x27;s sovereignty, maintain its territorial integrity defend the constitution and democratic institutions, maintain and enforce law and order, and render assistance in emergencies."}
{"text": "238. Constitutional limitations"}
{"text": "The actions of the security services must be exercised in accordance with the Constitution and the law, and operate on the basis of accountability. The President shall ensure that these obligations of the security services are complied with."}
{"text": "239. Authority of the People’s Majlis over the security services"}
{"text": "The People&#x27;s Majlis shall enact a statute on the organization of and the principles pursuant to which each security service shall operate."}
{"text": "The security services shall be subject to the authority of the People&#x27;s Majlis."}
{"text": "240. Separate services"}
{"text": "The security services shall be organized as two separate services, and shall operate independently of each other."}
{"text": "241. Multiparty committee of the People’s Majlis"}
{"text": "A committee of the People&#x27;s Majlis shall be established to exercise continuing oversight of the operations of the security services. The committee shall include representation from all the different political parties within the People&#x27;s Majlis."}
{"text": "242. Ministerial Responsibility"}
{"text": "Each security service shall be under the responsibility of a Minister, who shall be answerable for its operations to the President and to the People&#x27;s Majlis."}
{"text": "243. Military Service"}
{"text": "The primary object of the Military Service is to defend and protect the Republic, its territorial integrity, its Exclusive Economic Zone and the people."}
{"text": "If the President, as Commander in Chief, authorizes or orders the employment of the Military Service in defence of the Republic or as part of an international undertaking, the President shall without delay submit the authorization to the People&#x27;s Majlis. the People&#x27;s Majlis may at any time approve the authorization, or revoke the authorization."}
{"text": "244. Police Service"}
{"text": "The primary objects of the Police Service are:"}
{"text": "to maintain public order and safety;"}
{"text": "to protect and secure all people in the Maldives, and their property;"}
{"text": "to investigate crime, conservation of evidence and prepare cases for disposition by the courts; and"}
{"text": "to uphold the law."}
{"text": "245. Illegal orders and non-compliance"}
{"text": "No person shall give an illegal order to a member of the security services. Members of the security services shall not obey a manifestly illegal order."}
{"text": "246. Equal treatment"}
{"text": "Members of the security services shall treat all persons and groups equally without any discrimination, and with humanity and dignity in accordance with the decorous principles of Islam."}
{"text": "Members of the security services shall not engage in partisan political activity of any nature, and shall not affiliate themselves with any trade union or political party."}
{"text": "CHAPTER X. PROPERTY, LIABILITIES AND LEGAL ACTIONS of the STATE"}
{"text": "247. Property and assets owned and acquired by the State"}
{"text": "All property, assets and monies which at the commencement of this Constitution were vested in the State shall continue to vest in the State."}
{"text": "All property, assets and monies acquired for, or received by the State shall vest in the State."}
{"text": "248. Land, sea and naturally occurring valuable resources"}
{"text": "The land, sea, and seabed, including all fish within the territory of the Maldives, and all naturally occurring resources, including metallic ores, petroleum and gas, shall vest in the State."}
{"text": "All living, non-living and naturally occurring resources of value within the Exclusive Economic Zone and the seabed of the Maldives shall vest in the State."}
{"text": "249. Ownerless property"}
{"text": "Any property found within the territory of the Maldives and any property occurring in the seabed or found drifting in the sea, save those naturally occurring or formed in the sea, without a rightful owner, shall vest in the State."}
{"text": "All property such as gold, silver, other precious metals, jewelry, money and items of historical interest, excavated within the territory of the Maldives without a rightful owner, shall vest in the State."}
{"text": "250. Transactions relating to State property"}
{"text": "Any transfer, sale, lease, release, mortgage (to any person) or destruction of, any property or assets owned by the State, and any such other agreement, shall only be entered into in accordance with law."}
{"text": "Money, property or any other thing kept as a reserve in the State Treasury shall be used only after approval by a resolution passed by a two-thirds majority of the total membership of the People&#x27;s Majlis."}
{"text": "251. Prohibition of foreign ownership and foreign military purposes"}
{"text": "No foreign party, shall own or be given ownership of any part of the territory of the Maldives."}
{"text": "A foreign party shall not receive a lease of, or be given in any other way, any part of the territory of the Maldives for a period exceeding ninety nine years."}
{"text": "No part of the territory of the Maldives shall be used for foreign military purposes without the approval of the majority of the total membership of the People&#x27;s Majlis."}
{"text": "252. Legal actions in the name of the State"}
{"text": "Except where specified in this Constitution as the responsibility of another party, the Executive may sue or be sued on behalf of the State, and may defend any action against the State, in any court of the Maldives, in any foreign court, or in any other place."}
{"text": "CHAPTER XI. STATE OF EMERGENCY"}
{"text": "253. Declaration of a state of emergency"}
{"text": "In the event of natural disaster, dangerous epidemic disease, war, threat to national security, or threatened foreign aggression, the President may declare a state of emergency in all or part of the country for a period not exceeding thirty days."}
{"text": "254. Content of the declaration"}
{"text": "The declaration of a state of emergency shall specify the reasons for the declaration of an emergency, and include measures to deal with the emergency, which may include the temporary suspension of the operation of laws and infringement of certain fundamental rights and freedoms guaranteed by this Constitution in Chapter 2."}
{"text": "255. Limitations of the declaration"}
{"text": "Measures adopted in an emergency shall not contravene this Article."}
{"text": "Measures adopted in an emergency shall not restrict the following rights and freedoms contained in the following Articles of this Constitution:"}
{"text": "Article 21 (right to life);"}
{"text": "Article 25 (no slavery or forced labour);"}
{"text": "Article 27 (freedom of expression);"}
{"text": "Article 28 (freedom of the media);"}
{"text": "Article 42 (fair and transparent hearings);"}
{"text": "Article 48 (b) (rights on arrest or detention);"}
{"text": "Article 51 (rights of the accused);"}
{"text": "Article 52 (confessions and illegal evidence);"}
{"text": "Article 53 (assistance of legal counsel);"}
{"text": "Article 54 (no degrading treatment or torture);"}
{"text": "Article 55 (no imprisonment for non-fulfillment of contractual obligation);"}
{"text": "Article 57 (humane treatment of arrested or detained persons);"}
{"text": "Article 59 (retrospective legislation);"}
{"text": "Article 60 (prohibition of double jeopardy);"}
{"text": "Article 62 (retention of other rights);"}
{"text": "Article 64 (non-compliance with unlawful orders)."}
{"text": "Any infringement of rights and freedoms under this Constitution and the law shall be only to the extent strictly required by the emergency."}
{"text": "Measures adopted in an emergency shall be consistent with the obligations of the Maldives under international law applicable to states of emergency."}
{"text": "256. Publication"}
{"text": "The declaration of a state of emergency shall be published in the Government Gazette within three days of its issuance."}
{"text": "257. Submission of declaration to the Peoples Majlis"}
{"text": "The declaration of a state of emergency shall be submitted to the People&#x27;s Majlis within forty eight hours. If the People&#x27;s Majlis is not in session at the time of the declaration, it shall be re-called within fourteen days, inclusive of holidays, and the declaration of a state of emergency submitted to the People&#x27;s Majlis for approval."}
{"text": "The People&#x27;s Majlis may at any time:"}
{"text": "approve the declaration in whole or in part;"}
{"text": "extend the operation of the declaration for periods not exceeding thirty days at a time; or"}
{"text": "revoke the declaration."}
{"text": "Where the President deems it necessary to extend the length of the state of emergency, he shall submit the extension to the People&#x27;s Majlis prior to the expiry of the state of emergency, and obtain the approval of the People&#x27;s Majlis for such extension."}
{"text": "258. Determination of disputes relating to the declaration"}
{"text": "The Supreme Court shall determine any issues with regard to the validity in whole or part of the declaration or any law or order made pursuant to the emergency."}
{"text": "259. Expiry or revocation of declaration"}
{"text": "When the declaration of a state of emergency expires or is revoked by the People&#x27;s Majlis, all laws promulgated pursuant to the declaration shall cease to have effect."}
{"text": "260. Public announcement of expiry of state of emergency"}
{"text": "The President must publicly announce the expiration of the declaration of a state of emergency."}
{"text": "CHAPTER XII. AMENDMENT OF THE CONSTITUTION"}
{"text": "261. Amendment of the Constitution"}
{"text": "The Constitution may be amended by a Bill passed by a three quarters majority of the total membership of the People&#x27;s Majlis."}
{"text": "262. Assent of President"}
{"text": "The Bill amending the Constitution passed by the People&#x27;s Majlis shall come into force upon obtaining the written assent of the President."}
{"text": "Despite the provisions of article (a) above, the President shall give written assent to any amendments made by the People&#x27;s Majlis to the following provisions of this Constitution only after a public referendum decides so by a majority of the votes cast."}
{"text": "Any of the provisions contained in Chapter II(The Maldivian Charter of Rights and Freedoms) of this Constitution;"}
{"text": "Article 79(a) (Term of Majlis);"}
{"text": "Article 107 (Term of office), and Article 108 (Presidential election);"}
{"text": "where the amendment does not receive a majority approval in the public referendum, it shall be deemed to have been defeated."}
{"text": "263. Publication in Government Gazette"}
{"text": "After assent by the President, the Bill amending the Constitution passed by the People&#x27;s Majlis shall come into force after publication in the Government Gazette and on a date fixed by the People&#x27;s Majlis."}
{"text": "264. Non-assent by President and national referendum"}
{"text": "If the President does not assent to the Bill amending the Constitution passed by the People&#x27;s Majlis within fifteen days of receipt, the President shall inform the People&#x27;s Majlis specifying the reasons thereof. Where the President does not inform the People&#x27;s Majlis of the reasons thereof within fifteen days of receipt the President shall be deemed to have assented to the Bill."}
{"text": "If the President does not assent to the Bill amending the Constitution passed by the People&#x27;s Majlis and so informs the People&#x27;s Majlis, the People&#x27;s Majlis may within a period determined by the People&#x27;s Majlis call for a public referendum to vote on the adoption or rejection of the Bill"}
{"text": "If the Bill is approved by a majority in the public referendum specified in article (b), the President shall assent to the Bill within fifteen days and publish it in the Government Gazette."}
{"text": "265. Defeat of Bill"}
{"text": "Where the Bill amending this Constitution passed by the People&#x27;s Majlis does not receive a majority approval in the public referendum, it shall be deemed to have been defeated."}
{"text": "266. Provisions included in Bill"}
{"text": "The Bill amending the Constitution may not include provisions other than constitutional amendments and matters connected with the amendment."}
{"text": "267. No amendment during emergency"}
{"text": "No amendment shall be made to any provision of the Constitution during the existence of a state of emergency."}
{"text": "CHAPTER XIII. APPLICATION AND CONSTRUCTION OF THE CONSTITUTION"}
{"text": "268. Supremacy of the Constitution"}
{"text": "All laws of the Maldives must be enacted in accordance with this Constitution. Any law or part of any law inconsistent with this Constitution is, to the extent of its inconsistency, void and of no force and effect. The obligations imposed by this Constitution must be fulfilled. Any conduct contrary to this Constitution shall be invalid."}
{"text": "269. Continuance of laws in force"}
{"text": "Unless amended by the People&#x27;s Majlis, the laws in force at the time this Constitution comes into force which are not inconsistent with this Constitution shall continue to remain in force."}
{"text": "270. Continued effect of repealed laws"}
{"text": "Acts done pursuant to or in accordance with any law which is repealed upon the commencement of this Constitution due to its inconsistency with this Constitution, remain valid, and the repeal of any such law shall not affect any right or obligation of a person under such law or any punishment enforced under such law."}
{"text": "271. Regulations enacted under authority of Statute"}
{"text": "Regulations derive their authority from laws passed by the People&#x27;s Majlis pursuant to which they are enacted, and are enforceable pursuant to such lawful authority. Any regulations requiring compliance by citizens must only be enacted pursuant to authority granted by a law enacted by the People&#x27;s Majlis."}
{"text": "272. Ascertainment of time"}
{"text": "Terms, periods of times and dates in this Constitution shall be ascertained in accordance with the Gregorian Calendar."}
{"text": "273. Headings"}
{"text": "The table of contents, headings, and marginal notes are not part of this Constitution but are inserted for convenience of reference only."}
{"text": "274. Definitions"}
{"text": "In this Constitution, unless the context otherwise requires, the following words and phrases shall have the following meanings:"}
{"text": "&quot;present and voting&quot; means, of those members participating in the meeting at which the voting occurs, being present at the time of voting and voting either in favour of, or against, the motion being voted upon. In determining the majority of those members present and voting, members who did not vote either for or against the motion shall not be counted;"}
{"text": "&quot;a citizen&quot; means, any person specified as a citizen of the Maldives in Article 9 of this Constitution;"}
{"text": "&quot;court&quot; means, each and every place established by the Constitution, or by a law enacted by the People&#x27;s Majlis, for the purpose of conducting a trial by a judge or bench of judges;"}
{"text": "&quot;jurisdiction&quot; means, the area and matters over which an authority has power to exercise influence;"}
{"text": "&quot;election&quot; means, those elections in which, pursuant to the law to govern administrative districts under the principles of decentralized governance, citizens vote to select members of various councils, as well as general elections held to select persons as members of the People&#x27;s Majlis and presidential elections held to select a person to fill the post of President of the Republic. By-elections held to elect a person to any of the seats falling vacant comes within the meaning of elections;"}
{"text": "&quot;tenet of Islam&quot; means, the Holy Qur&#x27;an and those principles of Shari&#x27;ah whose provenance is not in dispute from among those found in the Sunna of the Noble Prophet, and those principles derived from these two foundations;"}
{"text": "&quot;Islamic Shari&#x27;ah&quot; means, the Holy Qur&#x27;an and the ways preferred by the learned people within the community and followers of the Sunnah in relation to criminal, civil, personal and other matters found in the Sunna;"}
{"text": "&quot;person&quot; or &quot;persons&quot; shall include natural and legal personalities;"}
{"text": "&quot;have a financial interest&quot; means, doing anything in a manner that could increase his property or wealth, or safeguard his property or wealth from loss;"}
{"text": "&quot;judge&quot; means, those persons appointed in accordance with this Constitution to conduct trials in the Supreme Court, High Court or Trial Courts;"}
{"text": "&quot;constitutional matter&quot; means, proceedings where the determination of the meaning of an Article of the Constitution or any part thereof is required, or proceedings requiring a determination whether a law or any part thereof, or a regulation or any part thereof, or an order issued by a State authority, or an act committed, or a decision taken, by an official of that authority contravenes the Constitution;"}
{"text": "&quot;enemy&quot; means, those foreign nationals who commit acts detrimental to the independence and sovereignty of the Maldives. Citizens are not included in the meaning of &quot;enemies&quot;;"}
{"text": "&quot;law&quot; means, those statutes enacted by the People&#x27;s Majlis and assented to by the President, and those regulations which are authorized by, and which fall within the ambit of, those statutes;"}
{"text": "&quot;threat to national security&quot; means a threat to the independence and sovereignty of the Maldives, or a threat of major damage to people&#x27;s lives, limbs or property. This includes terrorist attacks and acts of aggression committed using weapons. This, however, does not include the exercise by citizens of their legal rights to conduct peaceful activities in support of, or against various matters without contravening the law;"}
{"text": "&quot;territorial integrity&quot; means, the security of all persons, places and things within the territory of the Maldives or any part thereof and the Exclusive Economic Zone of the Maldives, and the retention of the entirety of the territory of the Maldives under the control of the Maldivian State;"}
{"text": "&quot;tribunal&quot; means any institution not constituting a court, authorized by law to adjudicate cases where a dispute arises between two or more parties and to which an application is made for adjudication thereto;"}
{"text": "&quot;tax&quot; or &quot;a tax&quot; means, all monies levied by the government from an individual or organization or other legal entity for the purpose of raising revenue for the State, and excluding any charge, fee or rent levied in accordance with law for the provision of a service."}
{"text": "In this Constitution, words denoted in the singular tense include the plural tense and vice versa."}
{"text": "CHAPTER XIV. TRANSITIONAL MATTERS"}
{"text": "275. Application of this Chapter"}
{"text": "Unless otherwise specifically provided in this Chapter:"}
{"text": "the provisions set out in this Chapter shall apply from the commencement of the Constitution until the election of and assumption of office by the President and the People&#x27;s Majlis; and"}
{"text": "actions during the transitional period shall be as provided in this Constitution."}
{"text": "276. Elections Commission"}
{"text": "A five member Elections Commission shall in the manner specified in this Chapter, be appointed within thirty days of the commencement of this Constitution."}
{"text": "The members of the Elections Commission shall be appointed as follows:-"}
{"text": "each of the political parties shall submit to the People&#x27;s Majlis one nomination for appointment to the Elections Commission;"}
{"text": "the People&#x27;s Majlis shall by resolution passed by a two-thirds majority of those present and voting confirm the appointment of five members to the Elections Commission from the nominations received from the political parties;"}
{"text": "where five members are not confirmed as provided for in article (b) (2), the political party or parties whose nominations were unsuccessful shall be given the opportunity to submit further nominations in numbers equal to the membership positions unfilled;"}
{"text": "where the nominations submitted by the political parties as provided for in article (a) falls short of five names; the political parties shall be afforded the opportunity to submit further names;"}
{"text": "the members of the Elections Commission shall appoint a Chairman of the Elections Commission from amongst themselves;"}
{"text": "for the purposes of this Chapter apolitical party shall mean a party which has held its elections and post bearers appointed to its posts."}
{"text": "277. Vacancy in Elections Commission"}
{"text": "Vacancies in the Elections Commission shall be filled in accordance with the provisions of this Chapter on appointments to the Elections Commission."}
{"text": "278. Qualifications of members of the Elections Commission"}
{"text": "The members of the Elections Commission established pursuant to this Chapter shall possess the qualifications specified in Article 169 of this Constitution."}
{"text": "A member of the Elections Commission shall not be a member of any political party."}
{"text": "279. Responsibilities of the Elections Commission"}
{"text": "The responsibilities of the Elections Commission appointed pursuant to this Chapter shall be to do all things necessary to conduct, manage, supervise and declare the results of the elections held pursuant to this Chapter, perform actions relating to political parties, and such additional functions specified in this Constitution to the extent required during the transitional period."}
{"text": "280. Term of Elections Commission"}
{"text": "The Elections Commission appointed pursuant to this Chapter shall continue until the appointment, by the People&#x27;s Majlis elected as specified in the Chapter, &quot;The People&#x27;s Majlis&quot; (of this Constitution), of a new Elections Commission as specified in the Chapter, &quot;Independent Commissions and Independent Offices&quot; (of this Constitution)."}
{"text": "281. Judicial Service Commission"}
{"text": "A Judicial Service Commission composed of the following persons, shall be appointed within thirty days of the commencement of this Constitution:"}
{"text": "a Judge of the Supreme Court other than the Chief Justice, elected by the Judges of the Supreme Court;"}
{"text": "a Judge of the High Court, elected by the Judges of the High Court;"}
{"text": "a Judge of the Trial Courts, elected by the Judges of the Trial Courts;"}
{"text": "a member of the People&#x27;s Majlis appointed by it;"}
{"text": "a member of the general public appointed by the People&#x27;s Majlis;"}
{"text": "the Chair of the Civil Service Commission;"}
{"text": "a person appointed by the President;"}
{"text": "a lawyer elected from among the lawyers licensed to practise in the Maldives by themselves."}
{"text": "Despite the provisions of article (a), a Judge from the Supreme Court shall only be appointed to the Judicial Service Commission after appointment of Judges to the Supreme Court as specified in this Chapter."}
{"text": "The Judicial Service Commission appointed as provided in this Chapter shall continue until constitution by the next elected People&#x27;s Majlis, of a Judicial Service Commission as specified in this Constitution."}
{"text": "282. Supreme Court"}
{"text": "A Supreme Court comprising of five Judges, shall within forty five days of the commencement of this Constitution, be appointed to deal with all legal disputes arising under this Constitution and all matters coming to it on appeal from the High Court."}
{"text": "Until the establishment of the Supreme Court as provided for in this Chapter and appointment of a person to carry out the responsibilities of the Chief Justice as specified in article (c), the highest authority for the administration of justice in the Maldives shall be a Judge of the High Court chosen from among themselves."}
{"text": "Until such time as the new People&#x27;s Majlis upon the recommendation of the Judicial Service Commission constituted as specified for in this Constitution, appoints a Chief Justice as provided for in Article 147, the responsibilities of that office shall be administered by a Judge chosen from within themselves by the Judges appointed to the Supreme Court in the manner specified in this Chapter."}
{"text": "All matters pending on appeal to the President at the commencement of this Constitution shall henceforth be dealt with and deemed to be pending before the Supreme Court. There shall be no further recourse of appeal from the High Court to the President from then onwards."}
{"text": "The Supreme Court established as provided for in this Chapter, in formulating the principles applicable to the appeal process shall ensure that the following cases have the opportunity of appeal:"}
{"text": "those cases disposed of by the High Court where the right of appeal has been lost between the commencement of this Constitution and establishment of the Supreme Court pursuant to this Chapter;"}
{"text": "those cases disposed of by the High Court between the commencement of this Constitution and establishment of the Supreme Court pursuant to this Chapter;"}
{"text": "283. Appointment of Judges to the Supreme Court"}
{"text": "The President as Head of the State shall appoint Judges to the Supreme Court established as specified in this Chapter. The appointments shall be determined after consulting the Judicial Service Commission and confirmation of the appointments by a two-thirds majority of the members of the People&#x27;s Majlis present and voting."}
{"text": "The Judges of the Supreme Court appointed pursuant to this Chapter shall possess the qualifications specified in Article 149 of this Constitution."}
{"text": "284. Term of Supreme Court"}
{"text": "The Supreme Court appointed pursuant to this Chapter shall continue until the establishment of the Supreme Court as provided for in Article 145 of this Constitution."}
{"text": "285. Continuation of Judges"}
{"text": "All Judges in office at the commencement of this Constitution except for the Chief Justice shall continue in office until such time as a determination pursuant to this Article."}
{"text": "The Judicial Service Commission established pursuant to Article 157 of this Constitution, shall within two years of the commencement of this Constitution determine whether or not the Judges in office at the said time, possess the qualification of Judges specified in Article 149."}
{"text": "Where it is determined as provided in article (b) that a Judge does not possess a qualification or the qualifications specified in Article 149, such Judge shall cease to hold office."}
{"text": "Where it is determined as provided in article (b) that a Judge possesses the qualifications specified in Article 149, such Judge shall be appointed as a Judge under this Constitution."}
{"text": "Except as provided in article (c), Judges may only be removed from office as specified in Article 154 of this Constitution."}
{"text": "286. Other courts"}
{"text": "All Courts in existence at commencement of this Constitution shall continue in existence until such time as new Courts are established in accordance with Article 141 of this Constitution."}
{"text": "287. Jurisdiction of the courts"}
{"text": "All matters pending before the Supreme Court established pursuant to this Chapter and the courts in existence at commencement of this Constitution shall henceforth be deemed to be pending before the courts established under this Constitution."}
{"text": "288. Prosecutor General"}
{"text": "The Prosecutor General shall be appointed in the manner specified in this Chapter within thirty days of the commencement of this Constitution."}
{"text": "Until such time as the Prosecutor General is appointed and assumes office, the responsibilities of the Prosecutor General shall be carried out the by the Attorney General. However the Attorney General shall only carry out the responsibilities of the Prosecutor General for a maximum period of thirty days."}
{"text": "The President as Head of the State shall appoint the Prosecutor General as provided in article (a). The appointment shall be made by submission of a nomination to the People&#x27;s Majlis within fifteen days of the commencement of this Constitution, and confirmation of the appointment by a two-thirds majority of the members of the People&#x27;s Majlis present and voting."}
{"text": "289. Anti-Corruption Commission"}
{"text": "The Anti-Corruption Commission shall in the manner specified in this Constitution be appointed within sixty days of the commencement of this Constitution."}
{"text": "290. Independent Commissions"}
{"text": "The Elections Commission, the Anti-Corruption Commission and the Prosecutor General shall in accordance with the provisions of this Constitution, be appointed within sixty days of the first sitting of the first People&#x27;s Majlis elected under this Constitution."}
{"text": "291. Continuance of laws"}
{"text": "All laws in force at the time this Constitution comes into force which are not inconsistent with this Constitution shall continue to remain in force."}
{"text": "292. No amendment to the Constitution"}
{"text": "No amendments may be made to the Constitution until the first election of and assumption of office by the President and the People&#x27;s Majlis under this Constitution."}
{"text": "293. Commencement of this Constitution"}
{"text": "This Constitution shall come into force, after approval of the Special Majlis, assent by the President and publication in the Government Gazette."}
{"text": "Upon the commencement of this Constitution, the &quot;Constitution of the Republic of the Maldives&quot; which came into force on 1 January 1998 shall be repealed."}
{"text": "Despite the provisions of article (a), until such time as the election of the President and the People&#x27;s Majlis, the specific provisions of this Chapter shall apply to the matters specified herein."}
{"text": "294. Continuance of the People’s Majlis"}
{"text": "The People&#x27;s Majlis in existence at the commencement of this Constitution shall continue until such time as the first elections of the People&#x27;s Majlis under this Constitution are held, and election of members and assumption of office by the members."}
{"text": "The People&#x27;s Majlis shall at the first sitting after the ratification of this Constitution, elect a Speaker and a Deputy Speaker from its members by secret ballot. Until such time as a Speaker and a Deputy Speaker is elected the People&#x27;s Majlis shall be presided over by the consecutively longest serving member from among those present. Where there are a number of members who have consecutively served the longest then the Majlis shall be presided over by the member most senior by age of those having served consecutively the longest."}
{"text": "Whenever there is a vacancy among the members of the People&#x27;s Majlis, and there is a period of six months between the date of the vacancy and the first sitting of the first elected People&#x27;s Majlis, an election shall be held to elect a member to the vacancy."}
{"text": "295. Responsibilities and powers of the People’s Majlis"}
{"text": "The People&#x27;s Majlis shall carry out the following:"}
{"text": "to do all things necessary to facilitate the elections specified in this Chapter in the manner provided herein;"}
{"text": "to determine what laws are contrary to the Constitution and to do all things necessary for the repeal or amendment of such laws;"}
{"text": "to enact legislation required under this Constitution;"}
{"text": "to deal with all routine legislative matters necessary for the functioning of the Executive and the Judiciary, and for the proper functioning and good governance of the Maldives."}
{"text": "The People&#x27;s Majlis shall continue to consider Bills submitted prior to the commencement of this Constitution, and not yet enacted, and any other matters if they are not contrary to the Constitution."}
{"text": "296. Election of the People’s Majlis"}
{"text": "The first election of members to the People&#x27;s Majlis to be held under this Constitution shall be held before 15 February 2009."}
{"text": "The People&#x27;s Majlis elected in accordance with article (a) shall after taking and subscribing the oath of office and assumption of office, hold the first meeting of the first People&#x27;s Majlis elected under this Constitution, before 1 March 2009."}
{"text": "297. Continuance of other posts and institutions"}
{"text": "Within two years of the commencement of this Constitution, excepting matters specifically provided herein, elections or appointments to posts shall be finalised in accordance with the provisions of this Constitution, and institutions specified in the Constitution shall also be created or established."}
{"text": "Until such time as elections or appointments to posts specified in this Constitution in the manner provided in this Chapter or this Constitution are finalised, persons elected or appointed at the commencement of this Constitution shall continue in office."}
{"text": "Until such time as creation of institutions specified in this Constitution in the manner provided in this Chapter or this Constitution, institutions created or established at the commencement of this Constitution shall continue."}
{"text": "298. Decentralised administration"}
{"text": "In order to provide for decentralised administration of the administrative divisions of the Maldives, elections to island councils, atoll councils and city councils as provided for in this Constitution shall be held before 1 July 2009."}
{"text": "299. Obedience to the Constitution"}
{"text": "The Executive, the People&#x27;s Majlis, the Judiciary, the Independent Commissions and persons in Independent Offices, all State institutions, all persons in any State post and all citizens shall comply with the provisions of the Constitution upon its commencement. The non-existence of a law shall not be an excuse for the infringement of any fundamental right or freedom under the Constitution."}
{"text": "Despite the provisions of article (a):-"}
{"text": "the People&#x27;s Majlis shall identify laws inconsistent with the Constitution at its commencement and approve a course of action until such inconsistent laws or parts thereof can be amended or repealed. The Executive shall within thirty days of the commencement of this Constitution draw up a list of such laws or part thereof and submit it to the People&#x27;s Majlis. Within ninety days of the commencement of this Constitution, the People&#x27;s Majlis shall draw up and approve a schedule for amending or revoking such laws."}
{"text": "the People&#x27;s Majlis shall until the enactment and commencement of laws required to give effect to this Constitution, approve a course of action in relation to these matters. The Executive shall within thirty days of the commencement of this Constitution draw up a list of such laws and submit it to the People&#x27;s Majlis. Within ninety days of the commencement of this Constitution, the People&#x27;s Majlis shall draw up and approve a schedule for enactment and commencement of such laws."}
{"text": "300. Continuation in office of the President and the Cabinet of Ministers"}
{"text": "Until such time as the first Presidential elections under this Constitution are held and a person elected to and assumes the post of President, the person holding the post of President at the commencement of this Constitution shall continue in office."}
{"text": "Until such time as the first Presidential elections under this Constitution are held and a person elected to and assumes the post of President, the Cabinet of Ministers appointed by the person holding the post of President at the commencement of this Constitution shall continue in office. The President has the discretion to make changes to the Cabinet of Ministers."}
{"text": "The Cabinet of Ministers appointed after the first Presidential elections held pursuant to this Constitution shall not contain any members of the People&#x27;s Majlis."}
{"text": "301. Presidential election"}
{"text": "The first presidential elections to be held under this Constitution shall be held before 10 October 2008."}
{"text": "The President elected in accordance with article (a) shall take and subscribe the oath of and assume office on 11 November 2008."}
{"text": "SCHEDULE 1. OATHS OF OFFICE"}
{"text": "1. OATH OF OFFICE OF PRESIDENT"}
{"text": "I, ...(name of person)..., do swear in the name of Almighty Allah that I will respect the religion of Islam, that I will uphold the Constitution of the Republic of Maldives and the fundamental rights of the Maldivian citizens, that I will bear true faith and allegiance to the Republic of Maldives, and will discharge the duties and responsibilities of the office of President honestly and faithfully in accordance with the Constitution and laws of the Republic of Maldives."}
{"text": "2. OATH OF OFFICE OF VICE PRESIDENT"}
{"text": "I, ...(name of person)..., do swear in the name of Almighty Allah that I will respect the religion of Islam, that I will uphold the Constitution of the Republic of Maldives and the fundamental rights of the Maldivian citizens, that I will bear true faith and allegiance to the Republic of Maldives, and will discharge the duties and responsibilities of the office of Vice President honestly and faithfully in accordance with the Constitution and laws of the Republic of Maldives."}
{"text": "3. OATH OF OFFICE OF MEMBERS OF THE CABINET"}
{"text": "I, ...(name of person)..., do swear in the name of Almighty Allah that I will respect the religion of Islam, that I will uphold the Constitution of the Republic of Maldives and the fundamental rights of the Maldivian citizens, that I will bear true faith and allegiance to the Republic of Maldives, and will discharge the duties and responsibilities entrusted to me by the President and my duties and responsibilities as Cabinet Minister/Attorney General honestly and faithfully in accordance with the Constitution and laws of the Republic of Maldives."}
{"text": "4. OATH OF OFFICE OF MEMBERS OF THE PEOPLE&#x27;S MAJLIS"}
{"text": "I, ...(name of person)..., do swear in the name of Almighty Allah that I will respect the religion of Islam, that I will uphold the Constitution of the Republic of Maldives and the fundamental rights of the Maldivian citizens, that I will bear true faith and allegiance to the Republic of Maldives, and will discharge my duties and responsibilities as a member of the People&#x27;s Majlis honestly and faithfully in accordance with the Constitution and the laws of the Republic of Maldives."}
{"text": "5. OATH OF OFFICE OF CHIEF JUSTICE AND JUDGES"}
{"text": "I, ...(name of person)..., do swear in the name of Almighty Allah that I will respect the religion of Islam, that I will uphold the Constitution and the laws of the Republic of Maldives, that I will uphold the fundamental rights of the Maldivian citizens and will discharge the duties and responsibilities of Chief Justice/Judge honestly and faithfully in accordance with the Constitution and laws of the Republic of Maldives."}
{"text": "6. OATH OF OFFICE OF MEMBERS OF INDEPENDENT COMMISSIONS AND INDEPENDENT OFFICES"}
{"text": "I, ...(name of person)..., do swear in the name of Almighty Allah that I will respect the religion of Islam, that I will uphold the Constitution of the Republic of Maldives, that I will bear true faith and allegiance to the Maldives, that I will uphold the fundamental rights of the Maldivian citizens and will discharge the duties and responsibilities of Auditor General/Prosecutor General/membership of the Elections Commission/membership of the Judicial Service Commission/membership of the Human Rights Commission/membership of the Civil Service Commission/membership of the Anti-Corruption Commission honestly and faithfully in accordance with the Constitution and laws of the Republic of Maldives."}
{"text": "SCHEDULE 2. ADMINISTRATIVE DIVISIONS"}
{"text": "Male’ (including Villingilli and Hulhumale’)"}
{"text": "HA Thiladhunmathi Uthuruburi"}
{"text": "HDh Thiladhunmathi Dhekunuburi"}
{"text": "Sh Miladhunmadhulu Uthuruburi"}
{"text": "N Miladhunmadhulu Dhekunuburi"}
{"text": "R Maalhosmadhulu Uthuruburi"}
{"text": "B Maalhosmadhulu Dhekunuburi"}
{"text": "Lh Faadhippolhu"}
{"text": "K Male’ Atoll"}
{"text": "AA Ari Atoll Uthuruburi"}
{"text": "ADh Ari Atoll Dhekunuburi"}
{"text": "V Felidhe Atoll"}
{"text": "M Mulakatoll"}
{"text": "F Nilandhe Atholhu Uthuruburi"}
{"text": "Dh Nilandhe Atholhu Dhekunuburi"}
{"text": "Th Kolhumadulu"}
{"text": "L Haddhunmathi"}
{"text": "GA Huvadhu Atholhu Uthuruburi"}
{"text": "GDh Huvadhu Atholhu Dhekunuburi"}
{"text": "Gn Fuvammulah"}
{"text": "S Addu Atoll"}
{"text": "SCHEDULE 3. NATIONAL FLAG"}
{"text": "1. National Flag"}
{"text": "[Image]"}
{"text": "2. Composition of national flag"}
{"text": "As provided in Article 12 of this Constitution, the national flag of the Republic of Maldives comprises of a green rectangle with a white crescent in the centre, the green rectangle being surrounded by a red border."}
{"text": "3. Dimensions"}
{"text": "The width of the national flag is two-thirds of its length. The width of the red border is one-fourth of the width of the flag. The radii of both curvatures crescent are one-third of the width of the green rectangle. They are drawn from two points on a centre line across the length of the green rectangle, the first point being nine-sixteenth and the second at five-eighths of the length, measured from the side nearer to the staff, joining together to form a crescent. When the flag is hoisted the curvature of the crescent should face out."}
{"text": "4. Colours"}
{"text": "Green-British Admiralty Colour Code No. T 1143 for nylon worsted bunting and No. T 817 A for other bunting."}
{"text": "Red-British Admiralty Colour Code No. T 1144 for nylon worsted bunting and No. T 818 A for other bunting."}
{"text": "White-British Admiralty Colour Code No. T1145 for nylon worsted bunting and T 819 A for other bunting."}
